import React, { useState, useEffect, Fragment } from 'react';
import { Cell, PieChart, Pie, ScatterChart, Scatter, XAxis, YAxis, CartesianGrid, Tooltip, DotProps } from 'recharts';
import styled from 'styled-components';
import Typography from '../OldTypography';
import { TableUnique } from 'typeorm';

type Rank = 'Safe' | 'Normal' | 'Dangerous' | 'VeryDangerous';
type StudentData = {
  name: string;
  gpa: string;
  hopemajor: string;
};

// 가상 데이터
// const RankData: StudentData[] = [
//   { name: 'ggg', gpa: '2.8', hopemajor: '경영학과' },
//   { name: 'hhh', gpa: '3.0', hopemajor: '경영학과' },
//   { name: 'iii', gpa: '3.5', hopemajor: '경영학과' },
//   { name: 'jjj', gpa: '3.5', hopemajor: '경영학과' },
//   { name: 'kkk', gpa: '3.5', hopemajor: '경영학과' },
//   { name: 'lll', gpa: '3.5', hopemajor: '경영학과' },
//   { name: 'mmm', gpa: '4.0', hopemajor: '경영학과' },
//   { name: 'nnn', gpa: '4.0', hopemajor: '경영학과' },
//   { name: 'hhh', gpa: '4.2', hopemajor: '경영학과' },
//   { name: '고대빵', gpa: '4.0', hopemajor: '경영학과' },
// ];

// 모집인원 수
// const Num = 10;

// const MyData: StudentData = { name: '고대빵', gpa: '4.0', hopemajor: '경영학과' };

// 전체 학점만 추출하여 내림차순으로 정렬
// const allGPAs = RankData.map((student) => parseFloat(student.gpa));
// allGPAs.sort((a, b) => b - a);

// const myGPA = parseFloat(MyData.gpa);

// MyData의 GPA를 포함한 전체 GPA 배열 생성
// const allGPAsIncludingMyGPA = [...allGPAs, myGPA];

// MyData의 GPA를 포함한 전체 GPA 배열을 내림차순으로 정렬
// allGPAsIncludingMyGPA.sort((a, b) => b - a);

// MyData의 등수 계산
// const myRank = allGPAsIncludingMyGPA.indexOf(myGPA) + 1;

// 등수를 퍼센트로 나타내기
// let myPercentile = (myRank / Num) * 100;

function calculateRank(applyNum: number, recruitNum: number, rankNum: number, myPercentile: number): Rank {
  //if (recruitNum <= applyNum) {
  if (myPercentile <= 25) {
    return 'Safe';
  } else if (myPercentile <= 50) {
    return 'Normal';
  } else if (myPercentile <= 75) {
    return 'Dangerous';
  } else {
    return 'VeryDangerous';
  }
  /*
  } 
  else {
    if (myPercentile <= 50) {
      return 'Safe';
    } else {
      return 'Normal';
    }
  }*/
}

interface myStageData {
  majorName: string;
  recruitNum: number;
  applyNum: number;
  rank: number;
}

const MyStageChart: React.FC<myStageData> = (data) => {
  let { majorName, recruitNum, applyNum, rank: rankNum } = data;
  const hopeMajor2 = localStorage.getItem('hopeMajor2') || '';
  if (hopeMajor2 === majorName) {
    applyNum++;
  }
  let myPercentile = (rankNum / applyNum) * 100;
  if (rankNum === applyNum && rankNum === 1) {
    myPercentile = 1;
  }
  // FIXME: applyNum 0일때?
  let rank: Rank = calculateRank(applyNum, recruitNum, rankNum, myPercentile); // 4단계 중 현재 위치

  let MyName: string = localStorage.getItem('nickname') || '';
  let HopeMajor: string = majorName;

  switch (rank) {
    case 'Safe':
      return (
        <div
          style={{
            position: 'relative',
            display: 'flex',
            alignItems: 'baseline',
            marginTop: '19px',
            marginLeft: '28px',
          }}
        >
          <svg xmlns="http://www.w3.org/2000/svg" width="262" height="135" viewBox="0 0 262 135" fill="none">
            <g filter="url(#filter0_d_3640_34493)">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M30 16C27.2386 16 25 18.2386 25 21V26.2265L16.5 31.134C15.8333 31.5189 15.8333 32.4811 16.5 32.866L25 37.7735V60C25 62.7614 27.2386 65 30 65H207C209.761 65 212 62.7614 212 60V21C212 18.2386 209.761 16 207 16H30Z"
                fill="#3AD54E"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34493"
                x="-34"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.227451 0 0 0 0 0.835294 0 0 0 0 0.305882 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34493" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34493" result="shape" />
              </filter>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '30px',
              marginLeft: '64px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M4.70033 14.1667L4.10866 14.7584C3.95345 14.9145 3.86633 15.1257 3.86633 15.3459C3.86633 15.566 3.95345 15.7772 4.10866 15.9334C4.26479 16.0886 4.476 16.1757 4.69616 16.1757C4.91631 16.1757 5.12752 16.0886 5.28366 15.9334L5.87533 15.3417C6.01185 15.1823 6.08319 14.9772 6.07509 14.7675C6.06698 14.5577 5.98004 14.3588 5.83163 14.2104C5.68322 14.062 5.48427 13.975 5.27454 13.9669C5.06481 13.9588 4.85974 14.0302 4.70033 14.1667ZM4.16699 10C4.16699 9.77901 4.07919 9.56705 3.92291 9.41077C3.76663 9.25449 3.55467 9.16669 3.33366 9.16669H2.50033C2.27931 9.16669 2.06735 9.25449 1.91107 9.41077C1.75479 9.56705 1.66699 9.77901 1.66699 10C1.66699 10.221 1.75479 10.433 1.91107 10.5893C2.06735 10.7456 2.27931 10.8334 2.50033 10.8334H3.33366C3.55467 10.8334 3.76663 10.7456 3.92291 10.5893C4.07919 10.433 4.16699 10.221 4.16699 10ZM10.0003 4.16669C10.2213 4.16669 10.4333 4.07889 10.5896 3.92261C10.7459 3.76633 10.8337 3.55437 10.8337 3.33335V2.50002C10.8337 2.27901 10.7459 2.06704 10.5896 1.91076C10.4333 1.75448 10.2213 1.66669 10.0003 1.66669C9.77931 1.66669 9.56735 1.75448 9.41107 1.91076C9.25479 2.06704 9.16699 2.27901 9.16699 2.50002V3.33335C9.16699 3.55437 9.25479 3.76633 9.41107 3.92261C9.56735 4.07889 9.77931 4.16669 10.0003 4.16669ZM4.70033 5.87502C4.85554 6.02897 5.06504 6.11577 5.28366 6.11669C5.39333 6.11732 5.50205 6.0963 5.60358 6.05483C5.70511 6.01336 5.79746 5.95226 5.87533 5.87502C6.03054 5.71889 6.11765 5.50768 6.11765 5.28752C6.11765 5.06737 6.03054 4.85616 5.87533 4.70002L5.28366 4.10835C5.12424 3.97183 4.91918 3.90049 4.70945 3.90859C4.49972 3.9167 4.30077 4.00364 4.15236 4.15205C4.00394 4.30046 3.917 4.49941 3.9089 4.70914C3.9008 4.91887 3.97214 5.12394 4.10866 5.28335L4.70033 5.87502ZM14.7003 6.11669C14.9189 6.11577 15.1284 6.02897 15.2837 5.87502L15.8753 5.28335C15.9626 5.20865 16.0334 5.11672 16.0834 5.01333C16.1335 4.90994 16.1616 4.79733 16.166 4.68256C16.1704 4.5678 16.1511 4.45336 16.1092 4.34642C16.0673 4.23948 16.0037 4.14236 15.9225 4.06115C15.8413 3.97993 15.7442 3.91638 15.6373 3.87449C15.5303 3.83259 15.4159 3.81326 15.3011 3.81769C15.1863 3.82212 15.0737 3.85023 14.9704 3.90025C14.867 3.95027 14.775 4.02112 14.7003 4.10835L14.167 4.70002C14.0118 4.85616 13.9247 5.06737 13.9247 5.28752C13.9247 5.50768 14.0118 5.71889 14.167 5.87502C14.3139 6.02116 14.51 6.10731 14.717 6.11669H14.7003ZM17.5003 9.16669H16.667C16.446 9.16669 16.234 9.25449 16.0777 9.41077C15.9215 9.56705 15.8337 9.77901 15.8337 10C15.8337 10.221 15.9215 10.433 16.0777 10.5893C16.234 10.7456 16.446 10.8334 16.667 10.8334H17.5003C17.7213 10.8334 17.9333 10.7456 18.0896 10.5893C18.2459 10.433 18.3337 10.221 18.3337 10C18.3337 9.77901 18.2459 9.56705 18.0896 9.41077C17.9333 9.25449 17.7213 9.16669 17.5003 9.16669ZM10.0003 15.8334C9.77931 15.8334 9.56735 15.9212 9.41107 16.0774C9.25479 16.2337 9.16699 16.4457 9.16699 16.6667V17.5C9.16699 17.721 9.25479 17.933 9.41107 18.0893C9.56735 18.2456 9.77931 18.3334 10.0003 18.3334C10.2213 18.3334 10.4333 18.2456 10.5896 18.0893C10.7459 17.933 10.8337 17.721 10.8337 17.5V16.6667C10.8337 16.4457 10.7459 16.2337 10.5896 16.0774C10.4333 15.9212 10.2213 15.8334 10.0003 15.8334ZM15.3003 14.1667C15.142 14.0786 14.9593 14.0446 14.7799 14.0696C14.6005 14.0947 14.4341 14.1776 14.306 14.3057C14.1779 14.4338 14.095 14.6002 14.0699 14.7796C14.0449 14.959 14.0789 15.1417 14.167 15.3L14.7587 15.8917C14.9148 16.0469 15.126 16.134 15.3462 16.134C15.5663 16.134 15.7775 16.0469 15.9337 15.8917C16.0889 15.7356 16.176 15.5243 16.176 15.3042C16.176 15.084 16.0889 14.8728 15.9337 14.7167L15.3003 14.1667ZM10.0003 5.41669C9.09383 5.41669 8.20769 5.68549 7.45396 6.18912C6.70024 6.69274 6.11278 7.40856 5.76588 8.24605C5.41898 9.08355 5.32821 10.0051 5.50506 10.8942C5.68191 11.7833 6.11843 12.5999 6.75942 13.2409C7.40041 13.8819 8.21708 14.3184 9.10616 14.4953C9.99524 14.6721 10.9168 14.5814 11.7543 14.2345C12.5918 13.8876 13.3076 13.3001 13.8112 12.5464C14.3149 11.7927 14.5837 10.9065 14.5837 10C14.5815 8.78512 14.0979 7.62061 13.2388 6.76155C12.3797 5.90248 11.2152 5.41889 10.0003 5.41669ZM10.0003 12.9167C9.42346 12.9167 8.85956 12.7456 8.37991 12.4251C7.90027 12.1047 7.52643 11.6491 7.30568 11.1162C7.08492 10.5832 7.02716 9.99679 7.1397 9.43101C7.25224 8.86523 7.53003 8.34553 7.93793 7.93763C8.34583 7.52972 8.86553 7.25194 9.43131 7.1394C9.99709 7.02686 10.5835 7.08462 11.1165 7.30537C11.6494 7.52613 12.105 7.89996 12.4254 8.37961C12.7459 8.85925 12.917 9.42316 12.917 10C12.917 10.7736 12.6097 11.5154 12.0627 12.0624C11.5157 12.6094 10.7739 12.9167 10.0003 12.9167Z"
                fill="white"
              />
            </svg>
            <Typography size="bodyText" style={{ color: 'var(--White, #FFF)', marginLeft: '10px' }}>
              매우안정
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: 'rgba(58, 213, 78, 0.80)',
              lineHeight: '128.571%',
              marginTop: '74px',
              marginLeft: '26px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 25%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="135"
            viewBox="0 0 296 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34487)">
              <mask id="path-1-inside-1_3640_34487" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M64 16C61.2386 16 59 18.2386 59 21V26.2265L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L59 37.7735V60C59 62.7614 61.2386 65 64 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H64Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M64 16C61.2386 16 59 18.2386 59 21V26.2265L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L59 37.7735V60C59 62.7614 61.2386 65 64 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H64Z"
                fill="white"
              />
              <path
                d="M59 26.2265L59.5 27.0925L60 26.8038V26.2265H59ZM50.5 31.134L51 32L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM59 37.7735H60V37.1962L59.5 36.9075L59 37.7735ZM60 21C60 18.7909 61.7909 17 64 17V15C60.6863 15 58 17.6863 58 21H60ZM60 26.2265V21H58V26.2265H60ZM58.5 25.3605L50 30.2679L51 32L59.5 27.0925L58.5 25.3605ZM50 30.2679C48.6667 31.0377 48.6667 32.9622 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L58.5 38.6395L59.5 36.9075L51 32L50 33.7321ZM60 60V37.7735H58V60H60ZM64 64C61.7909 64 60 62.2091 60 60H58C58 63.3137 60.6863 66 64 66V64ZM241 64H64V66H241V64ZM245 60C245 62.2091 243.209 64 241 64V66C244.314 66 247 63.3137 247 60H245ZM245 21V60H247V21H245ZM241 17C243.209 17 245 18.7909 245 21H247C247 17.6863 244.314 15 241 15V17ZM64 17H241V15H64V17Z"
                fill="url(#paint0_linear_3640_34487)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34487)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34487"
                x="0"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34487" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34487" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34487"
                x1="54.1925"
                y1="40"
                x2="246"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '30px',
              marginLeft: '244px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M14.717 6.95C14.9356 6.94908 15.1451 6.86229 15.3003 6.70833L15.892 6.11667C15.9792 6.04196 16.0501 5.95003 16.1001 5.84664C16.1501 5.74325 16.1782 5.63064 16.1827 5.51588C16.1871 5.40111 16.1678 5.28667 16.1259 5.17973C16.084 5.07279 16.0204 4.97567 15.9392 4.89446C15.858 4.81325 15.7609 4.7497 15.6539 4.7078C15.547 4.66591 15.4325 4.64657 15.3178 4.651C15.203 4.65543 15.0904 4.68354 14.987 4.73356C14.8836 4.78358 14.7917 4.85443 14.717 4.94167L14.167 5.53333C14.0118 5.68947 13.9247 5.90068 13.9247 6.12083C13.9247 6.34099 14.0118 6.5522 14.167 6.70833C14.3139 6.85447 14.51 6.94063 14.717 6.95ZM10.0003 5C10.2213 5 10.4333 4.9122 10.5896 4.75592C10.7459 4.59964 10.8337 4.38768 10.8337 4.16667V3.33333C10.8337 3.11232 10.7459 2.90036 10.5896 2.74408C10.4333 2.5878 10.2213 2.5 10.0003 2.5C9.77931 2.5 9.56735 2.5878 9.41107 2.74408C9.25479 2.90036 9.16699 3.11232 9.16699 3.33333V4.16667C9.16699 4.38768 9.25479 4.59964 9.41107 4.75592C9.56735 4.9122 9.77931 5 10.0003 5ZM3.33366 10H2.50033C2.27931 10 2.06735 10.0878 1.91107 10.2441C1.75479 10.4004 1.66699 10.6123 1.66699 10.8333C1.66699 11.0543 1.75479 11.2663 1.91107 11.4226C2.06735 11.5789 2.27931 11.6667 2.50033 11.6667H3.33366C3.55467 11.6667 3.76663 11.5789 3.92291 11.4226C4.07919 11.2663 4.16699 11.0543 4.16699 10.8333C4.16699 10.6123 4.07919 10.4004 3.92291 10.2441C3.76663 10.0878 3.55467 10 3.33366 10ZM4.70033 6.70833C4.85554 6.86229 5.06504 6.94908 5.28366 6.95C5.39333 6.95063 5.50205 6.92961 5.60358 6.88814C5.70511 6.84667 5.79746 6.78557 5.87533 6.70833C6.03054 6.5522 6.11765 6.34099 6.11765 6.12083C6.11765 5.90068 6.03054 5.68947 5.87533 5.53333L5.28366 4.94167C5.12424 4.80514 4.91918 4.73381 4.70945 4.74191C4.49972 4.75001 4.30077 4.83695 4.15236 4.98536C4.00394 5.13378 3.917 5.33273 3.9089 5.54246C3.9008 5.75219 3.97214 5.95725 4.10866 6.11667L4.70033 6.70833ZM17.5003 10H16.667C16.446 10 16.234 10.0878 16.0777 10.2441C15.9215 10.4004 15.8337 10.6123 15.8337 10.8333C15.8337 11.0543 15.9215 11.2663 16.0777 11.4226C16.234 11.5789 16.446 11.6667 16.667 11.6667H17.5003C17.7213 11.6667 17.9333 11.5789 18.0896 11.4226C18.2459 11.2663 18.3337 11.0543 18.3337 10.8333C18.3337 10.6123 18.2459 10.4004 18.0896 10.2441C17.9333 10.0878 17.7213 10 17.5003 10ZM9.16699 15.8333H6.66699C6.44598 15.8333 6.23402 15.9211 6.07774 16.0774C5.92146 16.2337 5.83366 16.4457 5.83366 16.6667C5.83366 16.8877 5.92146 17.0996 6.07774 17.2559C6.23402 17.4122 6.44598 17.5 6.66699 17.5H9.16699C9.38801 17.5 9.59997 17.4122 9.75625 17.2559C9.91253 17.0996 10.0003 16.8877 10.0003 16.6667C10.0003 16.4457 9.91253 16.2337 9.75625 16.0774C9.59997 15.9211 9.38801 15.8333 9.16699 15.8333ZM15.0003 12.5H14.267C14.4775 11.9696 14.5849 11.404 14.5837 10.8333C14.5837 9.61776 14.1008 8.45197 13.2412 7.59243C12.3817 6.73289 11.2159 6.25 10.0003 6.25C8.78475 6.25 7.61896 6.73289 6.75942 7.59243C5.89988 8.45197 5.41699 9.61776 5.41699 10.8333C5.41572 11.404 5.52319 11.9696 5.73366 12.5H5.00033C4.77931 12.5 4.56735 12.5878 4.41107 12.7441C4.25479 12.9004 4.16699 13.1123 4.16699 13.3333C4.16699 13.5543 4.25479 13.7663 4.41107 13.9226C4.56735 14.0789 4.77931 14.1667 5.00033 14.1667H15.0003C15.2213 14.1667 15.4333 14.0789 15.5896 13.9226C15.7459 13.7663 15.8337 13.5543 15.8337 13.3333C15.8337 13.1123 15.7459 12.9004 15.5896 12.7441C15.4333 12.5878 15.2213 12.5 15.0003 12.5ZM12.3753 12.5H7.62533C7.27522 12.0146 7.08581 11.4318 7.08366 10.8333C7.08366 10.0598 7.39095 9.31792 7.93793 8.77094C8.48491 8.22396 9.22678 7.91667 10.0003 7.91667C10.7739 7.91667 11.5157 8.22396 12.0627 8.77094C12.6097 9.31792 12.917 10.0598 12.917 10.8333C12.9148 11.4318 12.7254 12.0146 12.3753 12.5ZM13.3337 15.8333H12.5003C12.2793 15.8333 12.0674 15.9211 11.9111 16.0774C11.7548 16.2337 11.667 16.4457 11.667 16.6667C11.667 16.8877 11.7548 17.0996 11.9111 17.2559C12.0674 17.4122 12.2793 17.5 12.5003 17.5H13.3337C13.5547 17.5 13.7666 17.4122 13.9229 17.2559C14.0792 17.0996 14.167 16.8877 14.167 16.6667C14.167 16.4457 14.0792 16.2337 13.9229 16.0774C13.7666 15.9211 13.5547 15.8333 13.3337 15.8333Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              안정지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '74px',
              marginLeft: '214px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 50%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="135"
            viewBox="0 0 296 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34481)">
              <mask id="path-1-inside-1_3640_34481" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M65 16C62.2386 16 60 18.2386 60 21V25.6491L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L60 38.3509V60C60 62.7614 62.2386 65 65 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H65Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M65 16C62.2386 16 60 18.2386 60 21V25.6491L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L60 38.3509V60C60 62.7614 62.2386 65 65 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H65Z"
                fill="white"
              />
              <path
                d="M60 25.6491L60.5 26.5152L61 26.2265V25.6491H60ZM50.5 31.134L51 32L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM60 38.3509H61V37.7735L60.5 37.4848L60 38.3509ZM61 21C61 18.7909 62.7909 17 65 17V15C61.6863 15 59 17.6863 59 21H61ZM61 25.6491V21H59V25.6491H61ZM59.5 24.7831L50 30.2679L51 32L60.5 26.5152L59.5 24.7831ZM50 30.2679C48.6667 31.0378 48.6667 32.9623 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L59.5 39.2169L60.5 37.4848L51 32L50 33.7321ZM61 60V38.3509H59V60H61ZM65 64C62.7909 64 61 62.2091 61 60H59C59 63.3137 61.6863 66 65 66V64ZM241 64H65V66H241V64ZM245 60C245 62.2091 243.209 64 241 64V66C244.314 66 247 63.3137 247 60H245ZM245 21V60H247V21H245ZM241 17C243.209 17 245 18.7909 245 21H247C247 17.6863 244.314 15 241 15V17ZM65 17H241V15H65V17Z"
                fill="url(#paint0_linear_3640_34481)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34481)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34481"
                x="0"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34481" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34481" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34481"
                x1="54.1925"
                y1="40"
                x2="246"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '30px',
              marginLeft: '434px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M16.2253 8.78336C15.8304 7.90482 15.1901 7.15905 14.3815 6.63572C13.5728 6.11238 12.6302 5.83376 11.667 5.83336C11.2762 5.83652 10.8873 5.88688 10.5087 5.98336C10.0343 5.31381 9.37286 4.79922 8.60722 4.50413C7.84158 4.20903 7.00585 4.14656 6.20485 4.32456C5.40385 4.50256 4.67324 4.91311 4.10464 5.5047C3.53604 6.09629 3.15478 6.8426 3.00866 7.65003C2.46344 7.84631 2.00334 8.2259 1.70703 8.72389C1.41072 9.22188 1.29661 9.80733 1.3842 10.3801C1.4718 10.953 1.75566 11.4776 2.18725 11.8642C2.61885 12.2509 3.17136 12.4757 3.75032 12.5H4.58366C4.57497 12.6388 4.57497 12.7779 4.58366 12.9167C4.58366 13.6902 4.89095 14.4321 5.43793 14.9791C5.98491 15.5261 6.72678 15.8334 7.50032 15.8334H15.142C16.0039 15.8332 16.8373 15.5245 17.4913 14.9632C18.1454 14.4019 18.5769 13.625 18.7078 12.7731C18.8387 11.9212 18.6604 11.0505 18.205 10.3187C17.7497 9.58693 17.0474 9.04228 16.2253 8.78336ZM3.75032 10.8334C3.52931 10.8334 3.31735 10.7456 3.16107 10.5893C3.00479 10.433 2.91699 10.221 2.91699 10C2.91699 9.77901 3.00479 9.56705 3.16107 9.41077C3.31735 9.25449 3.52931 9.16669 3.75032 9.16669C3.97134 9.16669 4.1833 9.0789 4.33958 8.92262C4.49586 8.76634 4.58366 8.55437 4.58366 8.33336C4.58366 7.67032 4.84705 7.03444 5.31589 6.56559C5.78473 6.09675 6.42062 5.83336 7.08366 5.83336C7.43314 5.83524 7.77835 5.91037 8.097 6.05391C8.41565 6.19744 8.70067 6.4062 8.93366 6.66669C8.34226 7.05149 7.839 7.55709 7.45695 8.15027C7.0749 8.74345 6.82273 9.41077 6.71699 10.1084C6.24597 10.241 5.81603 10.4904 5.46699 10.8334H3.75032ZM15.142 14.1667H7.50032C7.1688 14.1667 6.85086 14.035 6.61644 13.8006C6.38202 13.5662 6.25032 13.2482 6.25032 12.9167C6.25032 12.5852 6.38202 12.2672 6.61644 12.0328C6.85086 11.7984 7.1688 11.6667 7.50032 11.6667C7.72134 11.6667 7.9333 11.5789 8.08958 11.4226C8.24586 11.2663 8.33366 11.0544 8.33366 10.8334C8.33723 10.0464 8.61909 9.28616 9.12936 8.68709C9.63962 8.08801 10.3454 7.68878 11.1217 7.56006C11.898 7.43134 12.6949 7.58142 13.3712 7.98375C14.0475 8.38608 14.5596 9.01471 14.817 9.75836C14.8646 9.90156 14.9503 10.0291 15.0647 10.1275C15.1792 10.2258 15.3182 10.2912 15.467 10.3167C15.94 10.4051 16.3633 10.666 16.6549 11.0489C16.9464 11.4317 17.0854 11.9091 17.0449 12.3886C17.0045 12.8681 16.7874 13.3155 16.4358 13.644C16.0842 13.9725 15.6231 14.1588 15.142 14.1667Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              소신지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '74px',
              marginLeft: '404px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 75%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="264"
            height="135"
            viewBox="0 0 264 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34475)">
              <mask id="path-1-inside-1_3640_34475" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M66 16C63.2386 16 61 18.2386 61 21L61 25.0718L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L61 38.9282L61 60C61 62.7614 63.2386 65 66 65H243C245.761 65 248 62.7614 248 60V21C248 18.2386 245.761 16 243 16H66Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M66 16C63.2386 16 61 18.2386 61 21L61 25.0718L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L61 38.9282L61 60C61 62.7614 63.2386 65 66 65H243C245.761 65 248 62.7614 248 60V21C248 18.2386 245.761 16 243 16H66Z"
                fill="white"
              />
              <path
                d="M61 21H62H61ZM61 25.0718L61.5 25.9378L62 25.6491V25.0718H61ZM50.5 31.134L51 32H51L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM61 38.9282H62V38.3509L61.5 38.0622L61 38.9282ZM61 60H62H61ZM62 21C62 18.7909 63.7909 17 66 17V15C62.6863 15 60 17.6863 60 21H62ZM62 25.0718L62 21H60L60 25.0718H62ZM60.5 24.2058L50 30.268L51 32L61.5 25.9378L60.5 24.2058ZM50 30.2679C48.6667 31.0378 48.6667 32.9623 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L60.5 39.7942L61.5 38.0622L51 32L50 33.7321ZM62 60L62 38.9282H60L60 60H62ZM66 64C63.7909 64 62 62.2091 62 60H60C60 63.3137 62.6863 66 66 66V64ZM243 64H66V66H243V64ZM247 60C247 62.2091 245.209 64 243 64V66C246.314 66 249 63.3137 249 60H247ZM247 21V60H249V21H247ZM243 17C245.209 17 247 18.7909 247 21H249C249 17.6863 246.314 15 243 15V17ZM66 17H243V15H66V17Z"
                fill="url(#paint0_linear_3640_34475)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34475)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34475"
                x="0"
                y="-14"
                width="298"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34475" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34475" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34475"
                x1="54.2353"
                y1="40"
                x2="248"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '30px',
              marginLeft: '624px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M6.66701 10.8333C6.44599 10.8333 6.23403 10.9211 6.07775 11.0774C5.92147 11.2337 5.83368 11.4456 5.83368 11.6667V15.8333C5.83368 16.0543 5.92147 16.2663 6.07775 16.4226C6.23403 16.5789 6.44599 16.6667 6.66701 16.6667C6.88802 16.6667 7.09998 16.5789 7.25626 16.4226C7.41254 16.2663 7.50034 16.0543 7.50034 15.8333V11.6667C7.50034 11.4456 7.41254 11.2337 7.25626 11.0774C7.09998 10.9211 6.88802 10.8333 6.66701 10.8333ZM10.0003 9.16666C9.77933 9.16666 9.56737 9.25446 9.41109 9.41074C9.25481 9.56702 9.16701 9.77898 9.16701 9.99999V17.5C9.16701 17.721 9.25481 17.933 9.41109 18.0893C9.56737 18.2455 9.77933 18.3333 10.0003 18.3333C10.2214 18.3333 10.4333 18.2455 10.5896 18.0893C10.7459 17.933 10.8337 17.721 10.8337 17.5V9.99999C10.8337 9.77898 10.7459 9.56702 10.5896 9.41074C10.4333 9.25446 10.2214 9.16666 10.0003 9.16666ZM15.3503 5.18333C14.8412 4.01333 13.9624 3.04256 12.8487 2.41977C11.7351 1.79697 10.4479 1.55652 9.18448 1.73525C7.92107 1.91398 6.75111 2.50204 5.85389 3.40931C4.95666 4.31657 4.38167 5.49301 4.21701 6.75833C3.48985 6.93413 2.84298 7.34943 2.38045 7.93742C1.91792 8.52541 1.66663 9.25189 1.66701 9.99999C1.66552 10.472 1.7643 10.939 1.9568 11.3699C2.14931 11.8009 2.43115 12.1861 2.78368 12.5C2.86481 12.5779 2.96087 12.6386 3.06609 12.6784C3.17131 12.7182 3.28349 12.7363 3.39589 12.7316C3.50828 12.7269 3.61856 12.6995 3.72007 12.651C3.82158 12.6025 3.91222 12.534 3.98654 12.4495C4.06085 12.3651 4.1173 12.2664 4.15248 12.1596C4.18766 12.0527 4.20084 11.9399 4.19123 11.8278C4.18162 11.7157 4.14941 11.6067 4.09656 11.5074C4.0437 11.4081 3.97128 11.3206 3.88368 11.25C3.70893 11.0923 3.56957 10.8994 3.47477 10.6839C3.37997 10.4685 3.33188 10.2354 3.33368 9.99999C3.33368 9.55797 3.50927 9.13404 3.82183 8.82148C4.13439 8.50892 4.55831 8.33333 5.00034 8.33333C5.22136 8.33333 5.43332 8.24553 5.5896 8.08925C5.74588 7.93297 5.83368 7.72101 5.83368 7.49999C5.8358 6.51439 6.18725 5.56146 6.82557 4.81048C7.46389 4.05951 8.34775 3.55912 9.32013 3.39822C10.2925 3.23732 11.2905 3.42633 12.1366 3.93167C12.9828 4.437 13.6225 5.22594 13.942 6.15833C13.9896 6.30153 14.0753 6.4291 14.1897 6.52744C14.3042 6.62577 14.4433 6.69117 14.592 6.71666C15.1705 6.81644 15.6954 7.1166 16.0748 7.56455C16.4542 8.01249 16.6638 8.57966 16.667 9.16666C16.6798 9.78023 16.4594 10.3758 16.0503 10.8333C15.9173 10.999 15.8526 11.2092 15.8694 11.421C15.8862 11.6329 15.9833 11.8303 16.1408 11.9729C16.2983 12.1155 16.5043 12.1925 16.7168 12.1883C16.9292 12.184 17.132 12.0988 17.2837 11.95C17.7427 11.4255 18.0628 10.7942 18.2146 10.1139C18.3665 9.43362 18.3453 8.72613 18.1529 8.05619C17.9605 7.38625 17.6032 6.77527 17.1136 6.27919C16.624 5.78311 16.0177 5.41778 15.3503 5.21666V5.18333ZM13.3337 10.8333C13.1127 10.8333 12.9007 10.9211 12.7444 11.0774C12.5881 11.2337 12.5003 11.4456 12.5003 11.6667V15.8333C12.5003 16.0543 12.5881 16.2663 12.7444 16.4226C12.9007 16.5789 13.1127 16.6667 13.3337 16.6667C13.5547 16.6667 13.7667 16.5789 13.9229 16.4226C14.0792 16.2663 14.167 16.0543 14.167 15.8333V11.6667C14.167 11.4456 14.0792 11.2337 13.9229 11.0774C13.7667 10.9211 13.5547 10.8333 13.3337 10.8333Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              위험지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '74px',
              marginLeft: '594px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 100%이내예요.
          </Typography>
          <div style={{ position: 'absolute', display: 'flex', flexDirection: 'column' }}>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="2"
              height="102"
              viewBox="0 0 2 102"
              fill="none"
              style={{ marginLeft: '828px', marginTop: '15px' }}
            >
              <path d="M1 101L0.999996 1" stroke="#DFDFDF" stroke-linecap="round" />
            </svg>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-103px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {HopeMajor}
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                  marginLeft: '5px',
                }}
              >
                이중 지원자들 중
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-3px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {MyName}님의&nbsp;
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  // marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                학점
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                }}
              >
                은 상위
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '770px', marginTop: '2px' }}>
              <Typography
                size="heading1"
                style={{
                  color: '#D85888',
                  marginLeft: '100px',
                  lineHeight: '104.167%',
                }}
              >
                {myPercentile.toFixed(2)}
              </Typography>
              <Typography
                size="heading1"
                style={{
                  color: 'rgba(67, 67, 67, 0.80)',
                  fontWeight: '400',
                  lineHeight: '104.167%',
                  marginLeft: '10px',
                }}
              >
                %
              </Typography>
            </div>
          </div>
        </div>
      );

    case 'Normal':
      return (
        <div
          style={{
            position: 'relative',
            display: 'flex',
            alignItems: 'baseline',
            marginTop: '4px',
            marginLeft: '26px',
          }}
        >
          <svg xmlns="http://www.w3.org/2000/svg" width="253" height="149" viewBox="0 0 253 149" fill="none">
            <g filter="url(#filter0_d_3640_34563)">
              <mask id="path-1-inside-1_3640_34563" fill="white">
                <path d="M16 35C16 32.2386 18.2386 30 21 30H198C200.761 30 203 32.2386 203 35V74C203 76.7614 200.761 79 198 79H21C18.2386 79 16 76.7614 16 74V35Z" />
              </mask>
              <path
                d="M16 35C16 32.2386 18.2386 30 21 30H198C200.761 30 203 32.2386 203 35V74C203 76.7614 200.761 79 198 79H21C18.2386 79 16 76.7614 16 74V35Z"
                fill="white"
              />
              <path
                d="M21 31H198V29H21V31ZM202 35V74H204V35H202ZM198 78H21V80H198V78ZM17 74V35H15V74H17ZM21 78C18.7909 78 17 76.2091 17 74H15C15 77.3137 17.6863 80 21 80V78ZM202 74C202 76.2091 200.209 78 198 78V80C201.314 80 204 77.3137 204 74H202ZM198 31C200.209 31 202 32.7909 202 35H204C204 31.6863 201.314 29 198 29V31ZM21 29C17.6863 29 15 31.6863 15 35H17C17 32.7909 18.7909 31 21 31V29Z"
                fill="url(#paint0_linear_3640_34563)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34563)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34563"
                x="-34"
                y="0"
                width="287"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34563" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34563" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34563"
                x1="20"
                y1="54"
                x2="203"
                y2="54"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '64px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M4.70033 14.1667L4.10866 14.7583C3.95345 14.9145 3.86633 15.1257 3.86633 15.3458C3.86633 15.566 3.95345 15.7772 4.10866 15.9333C4.26479 16.0885 4.476 16.1757 4.69616 16.1757C4.91631 16.1757 5.12752 16.0885 5.28366 15.9333L5.87533 15.3417C6.01185 15.1822 6.08319 14.9772 6.07509 14.7674C6.06698 14.5577 5.98004 14.3588 5.83163 14.2104C5.68322 14.0619 5.48427 13.975 5.27454 13.9669C5.06481 13.9588 4.85974 14.0301 4.70033 14.1667ZM4.16699 9.99999C4.16699 9.77898 4.07919 9.56702 3.92291 9.41073C3.76663 9.25445 3.55467 9.16666 3.33366 9.16666H2.50033C2.27931 9.16666 2.06735 9.25445 1.91107 9.41073C1.75479 9.56702 1.66699 9.77898 1.66699 9.99999C1.66699 10.221 1.75479 10.433 1.91107 10.5892C2.06735 10.7455 2.27931 10.8333 2.50033 10.8333H3.33366C3.55467 10.8333 3.76663 10.7455 3.92291 10.5892C4.07919 10.433 4.16699 10.221 4.16699 9.99999ZM10.0003 4.16666C10.2213 4.16666 10.4333 4.07886 10.5896 3.92258C10.7459 3.7663 10.8337 3.55434 10.8337 3.33332V2.49999C10.8337 2.27898 10.7459 2.06701 10.5896 1.91073C10.4333 1.75445 10.2213 1.66666 10.0003 1.66666C9.77931 1.66666 9.56735 1.75445 9.41107 1.91073C9.25479 2.06701 9.16699 2.27898 9.16699 2.49999V3.33332C9.16699 3.55434 9.25479 3.7663 9.41107 3.92258C9.56735 4.07886 9.77931 4.16666 10.0003 4.16666ZM4.70033 5.87499C4.85554 6.02894 5.06504 6.11574 5.28366 6.11666C5.39333 6.11729 5.50205 6.09627 5.60358 6.0548C5.70511 6.01333 5.79746 5.95222 5.87533 5.87499C6.03054 5.71885 6.11765 5.50764 6.11765 5.28749C6.11765 5.06734 6.03054 4.85613 5.87533 4.69999L5.28366 4.10832C5.12424 3.9718 4.91918 3.90046 4.70945 3.90856C4.49972 3.91666 4.30077 4.00361 4.15236 4.15202C4.00394 4.30043 3.917 4.49938 3.9089 4.70911C3.9008 4.91884 3.97214 5.12391 4.10866 5.28332L4.70033 5.87499ZM14.7003 6.11666C14.9189 6.11574 15.1284 6.02894 15.2837 5.87499L15.8753 5.28332C15.9626 5.20862 16.0334 5.11669 16.0834 5.0133C16.1335 4.90991 16.1616 4.7973 16.166 4.68253C16.1704 4.56777 16.1511 4.45333 16.1092 4.34639C16.0673 4.23945 16.0037 4.14233 15.9225 4.06111C15.8413 3.9799 15.7442 3.91635 15.6373 3.87446C15.5303 3.83256 15.4159 3.81323 15.3011 3.81766C15.1863 3.82209 15.0737 3.8502 14.9704 3.90022C14.867 3.95024 14.775 4.02109 14.7003 4.10832L14.167 4.69999C14.0118 4.85613 13.9247 5.06734 13.9247 5.28749C13.9247 5.50764 14.0118 5.71885 14.167 5.87499C14.3139 6.02113 14.51 6.10728 14.717 6.11666H14.7003ZM17.5003 9.16666H16.667C16.446 9.16666 16.234 9.25445 16.0777 9.41073C15.9215 9.56702 15.8337 9.77898 15.8337 9.99999C15.8337 10.221 15.9215 10.433 16.0777 10.5892C16.234 10.7455 16.446 10.8333 16.667 10.8333H17.5003C17.7213 10.8333 17.9333 10.7455 18.0896 10.5892C18.2459 10.433 18.3337 10.221 18.3337 9.99999C18.3337 9.77898 18.2459 9.56702 18.0896 9.41073C17.9333 9.25445 17.7213 9.16666 17.5003 9.16666ZM10.0003 15.8333C9.77931 15.8333 9.56735 15.9211 9.41107 16.0774C9.25479 16.2337 9.16699 16.4456 9.16699 16.6667V17.5C9.16699 17.721 9.25479 17.933 9.41107 18.0892C9.56735 18.2455 9.77931 18.3333 10.0003 18.3333C10.2213 18.3333 10.4333 18.2455 10.5896 18.0892C10.7459 17.933 10.8337 17.721 10.8337 17.5V16.6667C10.8337 16.4456 10.7459 16.2337 10.5896 16.0774C10.4333 15.9211 10.2213 15.8333 10.0003 15.8333ZM15.3003 14.1667C15.142 14.0786 14.9593 14.0445 14.7799 14.0696C14.6005 14.0947 14.4341 14.1776 14.306 14.3057C14.1779 14.4338 14.095 14.6001 14.0699 14.7795C14.0449 14.959 14.0789 15.1417 14.167 15.3L14.7587 15.8917C14.9148 16.0469 15.126 16.134 15.3462 16.134C15.5663 16.134 15.7775 16.0469 15.9337 15.8917C16.0889 15.7355 16.176 15.5243 16.176 15.3042C16.176 15.084 16.0889 14.8728 15.9337 14.7167L15.3003 14.1667ZM10.0003 5.41666C9.09383 5.41666 8.20769 5.68546 7.45396 6.18909C6.70024 6.69271 6.11278 7.40853 5.76588 8.24602C5.41898 9.08352 5.32821 10.0051 5.50506 10.8942C5.68191 11.7832 6.11843 12.5999 6.75942 13.2409C7.40041 13.8819 8.21708 14.3184 9.10616 14.4953C9.99524 14.6721 10.9168 14.5813 11.7543 14.2344C12.5918 13.8875 13.3076 13.3001 13.8112 12.5464C14.3149 11.7926 14.5837 10.9065 14.5837 9.99999C14.5815 8.78509 14.0979 7.62058 13.2388 6.76152C12.3797 5.90245 11.2152 5.41886 10.0003 5.41666ZM10.0003 12.9167C9.42346 12.9167 8.85956 12.7456 8.37991 12.4251C7.90027 12.1046 7.52643 11.6491 7.30568 11.1161C7.08492 10.5832 7.02716 9.99675 7.1397 9.43098C7.25224 8.8652 7.53003 8.3455 7.93793 7.9376C8.34583 7.52969 8.86553 7.25191 9.43131 7.13937C9.99709 7.02683 10.5835 7.08459 11.1165 7.30534C11.6494 7.5261 12.105 7.89993 12.4254 8.37958C12.7459 8.85922 12.917 9.42313 12.917 9.99999C12.917 10.7735 12.6097 11.5154 12.0627 12.0624C11.5157 12.6094 10.7739 12.9167 10.0003 12.9167Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              매우안정
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '26px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 25%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="149"
            viewBox="0 0 296 149"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34580)">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M64 30C61.2386 30 59 32.2386 59 35V40.2265L50.5 45.134C49.8333 45.5189 49.8333 46.4811 50.5 46.866L59 51.7735V74C59 76.7614 61.2386 79 64 79H241C243.761 79 246 76.7614 246 74V35C246 32.2386 243.761 30 241 30H64Z"
                fill="#4894E3"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34580"
                x="0"
                y="0"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.282353 0 0 0 0 0.580392 0 0 0 0 0.890196 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34580" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34580" result="shape" />
              </filter>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '244px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M14.717 6.95C14.9356 6.94908 15.1451 6.86229 15.3003 6.70833L15.892 6.11667C15.9792 6.04196 16.0501 5.95003 16.1001 5.84664C16.1501 5.74325 16.1782 5.63064 16.1827 5.51588C16.1871 5.40111 16.1678 5.28667 16.1259 5.17973C16.084 5.07279 16.0204 4.97567 15.9392 4.89446C15.858 4.81325 15.7609 4.7497 15.6539 4.7078C15.547 4.66591 15.4325 4.64657 15.3178 4.651C15.203 4.65543 15.0904 4.68354 14.987 4.73356C14.8836 4.78358 14.7917 4.85443 14.717 4.94167L14.167 5.53333C14.0118 5.68947 13.9247 5.90068 13.9247 6.12083C13.9247 6.34099 14.0118 6.5522 14.167 6.70833C14.3139 6.85447 14.51 6.94063 14.717 6.95ZM10.0003 5C10.2213 5 10.4333 4.9122 10.5896 4.75592C10.7459 4.59964 10.8337 4.38768 10.8337 4.16667V3.33333C10.8337 3.11232 10.7459 2.90036 10.5896 2.74408C10.4333 2.5878 10.2213 2.5 10.0003 2.5C9.77931 2.5 9.56735 2.5878 9.41107 2.74408C9.25479 2.90036 9.16699 3.11232 9.16699 3.33333V4.16667C9.16699 4.38768 9.25479 4.59964 9.41107 4.75592C9.56735 4.9122 9.77931 5 10.0003 5ZM3.33366 10H2.50033C2.27931 10 2.06735 10.0878 1.91107 10.2441C1.75479 10.4004 1.66699 10.6123 1.66699 10.8333C1.66699 11.0543 1.75479 11.2663 1.91107 11.4226C2.06735 11.5789 2.27931 11.6667 2.50033 11.6667H3.33366C3.55467 11.6667 3.76663 11.5789 3.92291 11.4226C4.07919 11.2663 4.16699 11.0543 4.16699 10.8333C4.16699 10.6123 4.07919 10.4004 3.92291 10.2441C3.76663 10.0878 3.55467 10 3.33366 10ZM4.70033 6.70833C4.85554 6.86229 5.06504 6.94908 5.28366 6.95C5.39333 6.95063 5.50205 6.92961 5.60358 6.88814C5.70511 6.84667 5.79746 6.78557 5.87533 6.70833C6.03054 6.5522 6.11765 6.34099 6.11765 6.12083C6.11765 5.90068 6.03054 5.68947 5.87533 5.53333L5.28366 4.94167C5.12424 4.80514 4.91918 4.73381 4.70945 4.74191C4.49972 4.75001 4.30077 4.83695 4.15236 4.98536C4.00394 5.13378 3.917 5.33273 3.9089 5.54246C3.9008 5.75219 3.97214 5.95725 4.10866 6.11667L4.70033 6.70833ZM17.5003 10H16.667C16.446 10 16.234 10.0878 16.0777 10.2441C15.9215 10.4004 15.8337 10.6123 15.8337 10.8333C15.8337 11.0543 15.9215 11.2663 16.0777 11.4226C16.234 11.5789 16.446 11.6667 16.667 11.6667H17.5003C17.7213 11.6667 17.9333 11.5789 18.0896 11.4226C18.2459 11.2663 18.3337 11.0543 18.3337 10.8333C18.3337 10.6123 18.2459 10.4004 18.0896 10.2441C17.9333 10.0878 17.7213 10 17.5003 10ZM9.16699 15.8333H6.66699C6.44598 15.8333 6.23402 15.9211 6.07774 16.0774C5.92146 16.2337 5.83366 16.4457 5.83366 16.6667C5.83366 16.8877 5.92146 17.0996 6.07774 17.2559C6.23402 17.4122 6.44598 17.5 6.66699 17.5H9.16699C9.38801 17.5 9.59997 17.4122 9.75625 17.2559C9.91253 17.0996 10.0003 16.8877 10.0003 16.6667C10.0003 16.4457 9.91253 16.2337 9.75625 16.0774C9.59997 15.9211 9.38801 15.8333 9.16699 15.8333ZM15.0003 12.5H14.267C14.4775 11.9696 14.5849 11.404 14.5837 10.8333C14.5837 9.61776 14.1008 8.45197 13.2412 7.59243C12.3817 6.73289 11.2159 6.25 10.0003 6.25C8.78475 6.25 7.61896 6.73289 6.75942 7.59243C5.89988 8.45197 5.41699 9.61776 5.41699 10.8333C5.41572 11.404 5.52319 11.9696 5.73366 12.5H5.00033C4.77931 12.5 4.56735 12.5878 4.41107 12.7441C4.25479 12.9004 4.16699 13.1123 4.16699 13.3333C4.16699 13.5543 4.25479 13.7663 4.41107 13.9226C4.56735 14.0789 4.77931 14.1667 5.00033 14.1667H15.0003C15.2213 14.1667 15.4333 14.0789 15.5896 13.9226C15.7459 13.7663 15.8337 13.5543 15.8337 13.3333C15.8337 13.1123 15.7459 12.9004 15.5896 12.7441C15.4333 12.5878 15.2213 12.5 15.0003 12.5ZM12.3753 12.5H7.62533C7.27522 12.0146 7.08581 11.4318 7.08366 10.8333C7.08366 10.0598 7.39095 9.31792 7.93793 8.77094C8.48491 8.22396 9.22678 7.91667 10.0003 7.91667C10.7739 7.91667 11.5157 8.22396 12.0627 8.77094C12.6097 9.31792 12.917 10.0598 12.917 10.8333C12.9148 11.4318 12.7254 12.0146 12.3753 12.5ZM13.3337 15.8333H12.5003C12.2793 15.8333 12.0674 15.9211 11.9111 16.0774C11.7548 16.2337 11.667 16.4457 11.667 16.6667C11.667 16.8877 11.7548 17.0996 11.9111 17.2559C12.0674 17.4122 12.2793 17.5 12.5003 17.5H13.3337C13.5547 17.5 13.7666 17.4122 13.9229 17.2559C14.0792 17.0996 14.167 16.8877 14.167 16.6667C14.167 16.4457 14.0792 16.2337 13.9229 16.0774C13.7666 15.9211 13.5547 15.8333 13.3337 15.8333Z"
                fill="white"
              />
            </svg>
            <Typography size="bodyText" style={{ color: 'var(--White, #FFF)', marginLeft: '10px' }}>
              안정지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: 'rgba(72, 148, 227, 0.80)',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '214px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 50%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="135"
            viewBox="0 0 296 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34481)">
              <mask id="path-1-inside-1_3640_34481" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M65 16C62.2386 16 60 18.2386 60 21V25.6491L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L60 38.3509V60C60 62.7614 62.2386 65 65 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H65Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M65 16C62.2386 16 60 18.2386 60 21V25.6491L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L60 38.3509V60C60 62.7614 62.2386 65 65 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H65Z"
                fill="white"
              />
              <path
                d="M60 25.6491L60.5 26.5152L61 26.2265V25.6491H60ZM50.5 31.134L51 32L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM60 38.3509H61V37.7735L60.5 37.4848L60 38.3509ZM61 21C61 18.7909 62.7909 17 65 17V15C61.6863 15 59 17.6863 59 21H61ZM61 25.6491V21H59V25.6491H61ZM59.5 24.7831L50 30.2679L51 32L60.5 26.5152L59.5 24.7831ZM50 30.2679C48.6667 31.0378 48.6667 32.9623 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L59.5 39.2169L60.5 37.4848L51 32L50 33.7321ZM61 60V38.3509H59V60H61ZM65 64C62.7909 64 61 62.2091 61 60H59C59 63.3137 61.6863 66 65 66V64ZM241 64H65V66H241V64ZM245 60C245 62.2091 243.209 64 241 64V66C244.314 66 247 63.3137 247 60H245ZM245 21V60H247V21H245ZM241 17C243.209 17 245 18.7909 245 21H247C247 17.6863 244.314 15 241 15V17ZM65 17H241V15H65V17Z"
                fill="url(#paint0_linear_3640_34481)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34481)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34481"
                x="0"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34481" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34481" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34481"
                x1="54.1925"
                y1="40"
                x2="246"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '434px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M16.2253 8.78336C15.8304 7.90482 15.1901 7.15905 14.3815 6.63572C13.5728 6.11238 12.6302 5.83376 11.667 5.83336C11.2762 5.83652 10.8873 5.88688 10.5087 5.98336C10.0343 5.31381 9.37286 4.79922 8.60722 4.50413C7.84158 4.20903 7.00585 4.14656 6.20485 4.32456C5.40385 4.50256 4.67324 4.91311 4.10464 5.5047C3.53604 6.09629 3.15478 6.8426 3.00866 7.65003C2.46344 7.84631 2.00334 8.2259 1.70703 8.72389C1.41072 9.22188 1.29661 9.80733 1.3842 10.3801C1.4718 10.953 1.75566 11.4776 2.18725 11.8642C2.61885 12.2509 3.17136 12.4757 3.75032 12.5H4.58366C4.57497 12.6388 4.57497 12.7779 4.58366 12.9167C4.58366 13.6902 4.89095 14.4321 5.43793 14.9791C5.98491 15.5261 6.72678 15.8334 7.50032 15.8334H15.142C16.0039 15.8332 16.8373 15.5245 17.4913 14.9632C18.1454 14.4019 18.5769 13.625 18.7078 12.7731C18.8387 11.9212 18.6604 11.0505 18.205 10.3187C17.7497 9.58693 17.0474 9.04228 16.2253 8.78336ZM3.75032 10.8334C3.52931 10.8334 3.31735 10.7456 3.16107 10.5893C3.00479 10.433 2.91699 10.221 2.91699 10C2.91699 9.77901 3.00479 9.56705 3.16107 9.41077C3.31735 9.25449 3.52931 9.16669 3.75032 9.16669C3.97134 9.16669 4.1833 9.0789 4.33958 8.92262C4.49586 8.76634 4.58366 8.55437 4.58366 8.33336C4.58366 7.67032 4.84705 7.03444 5.31589 6.56559C5.78473 6.09675 6.42062 5.83336 7.08366 5.83336C7.43314 5.83524 7.77835 5.91037 8.097 6.05391C8.41565 6.19744 8.70067 6.4062 8.93366 6.66669C8.34226 7.05149 7.839 7.55709 7.45695 8.15027C7.0749 8.74345 6.82273 9.41077 6.71699 10.1084C6.24597 10.241 5.81603 10.4904 5.46699 10.8334H3.75032ZM15.142 14.1667H7.50032C7.1688 14.1667 6.85086 14.035 6.61644 13.8006C6.38202 13.5662 6.25032 13.2482 6.25032 12.9167C6.25032 12.5852 6.38202 12.2672 6.61644 12.0328C6.85086 11.7984 7.1688 11.6667 7.50032 11.6667C7.72134 11.6667 7.9333 11.5789 8.08958 11.4226C8.24586 11.2663 8.33366 11.0544 8.33366 10.8334C8.33723 10.0464 8.61909 9.28616 9.12936 8.68709C9.63962 8.08801 10.3454 7.68878 11.1217 7.56006C11.898 7.43134 12.6949 7.58142 13.3712 7.98375C14.0475 8.38608 14.5596 9.01471 14.817 9.75836C14.8646 9.90156 14.9503 10.0291 15.0647 10.1275C15.1792 10.2258 15.3182 10.2912 15.467 10.3167C15.94 10.4051 16.3633 10.666 16.6549 11.0489C16.9464 11.4317 17.0854 11.9091 17.0449 12.3886C17.0045 12.8681 16.7874 13.3155 16.4358 13.644C16.0842 13.9725 15.6231 14.1588 15.142 14.1667Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              소신지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '404px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 75%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="264"
            height="135"
            viewBox="0 0 264 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34475)">
              <mask id="path-1-inside-1_3640_34475" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M66 16C63.2386 16 61 18.2386 61 21L61 25.0718L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L61 38.9282L61 60C61 62.7614 63.2386 65 66 65H243C245.761 65 248 62.7614 248 60V21C248 18.2386 245.761 16 243 16H66Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M66 16C63.2386 16 61 18.2386 61 21L61 25.0718L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L61 38.9282L61 60C61 62.7614 63.2386 65 66 65H243C245.761 65 248 62.7614 248 60V21C248 18.2386 245.761 16 243 16H66Z"
                fill="white"
              />
              <path
                d="M61 21H62H61ZM61 25.0718L61.5 25.9378L62 25.6491V25.0718H61ZM50.5 31.134L51 32H51L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM61 38.9282H62V38.3509L61.5 38.0622L61 38.9282ZM61 60H62H61ZM62 21C62 18.7909 63.7909 17 66 17V15C62.6863 15 60 17.6863 60 21H62ZM62 25.0718L62 21H60L60 25.0718H62ZM60.5 24.2058L50 30.268L51 32L61.5 25.9378L60.5 24.2058ZM50 30.2679C48.6667 31.0378 48.6667 32.9623 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L60.5 39.7942L61.5 38.0622L51 32L50 33.7321ZM62 60L62 38.9282H60L60 60H62ZM66 64C63.7909 64 62 62.2091 62 60H60C60 63.3137 62.6863 66 66 66V64ZM243 64H66V66H243V64ZM247 60C247 62.2091 245.209 64 243 64V66C246.314 66 249 63.3137 249 60H247ZM247 21V60H249V21H247ZM243 17C245.209 17 247 18.7909 247 21H249C249 17.6863 246.314 15 243 15V17ZM66 17H243V15H66V17Z"
                fill="url(#paint0_linear_3640_34475)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34475)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34475"
                x="0"
                y="-14"
                width="298"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34475" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34475" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34475"
                x1="54.2353"
                y1="40"
                x2="248"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '624px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M6.66701 10.8333C6.44599 10.8333 6.23403 10.9211 6.07775 11.0774C5.92147 11.2337 5.83368 11.4456 5.83368 11.6667V15.8333C5.83368 16.0543 5.92147 16.2663 6.07775 16.4226C6.23403 16.5789 6.44599 16.6667 6.66701 16.6667C6.88802 16.6667 7.09998 16.5789 7.25626 16.4226C7.41254 16.2663 7.50034 16.0543 7.50034 15.8333V11.6667C7.50034 11.4456 7.41254 11.2337 7.25626 11.0774C7.09998 10.9211 6.88802 10.8333 6.66701 10.8333ZM10.0003 9.16666C9.77933 9.16666 9.56737 9.25446 9.41109 9.41074C9.25481 9.56702 9.16701 9.77898 9.16701 9.99999V17.5C9.16701 17.721 9.25481 17.933 9.41109 18.0893C9.56737 18.2455 9.77933 18.3333 10.0003 18.3333C10.2214 18.3333 10.4333 18.2455 10.5896 18.0893C10.7459 17.933 10.8337 17.721 10.8337 17.5V9.99999C10.8337 9.77898 10.7459 9.56702 10.5896 9.41074C10.4333 9.25446 10.2214 9.16666 10.0003 9.16666ZM15.3503 5.18333C14.8412 4.01333 13.9624 3.04256 12.8487 2.41977C11.7351 1.79697 10.4479 1.55652 9.18448 1.73525C7.92107 1.91398 6.75111 2.50204 5.85389 3.40931C4.95666 4.31657 4.38167 5.49301 4.21701 6.75833C3.48985 6.93413 2.84298 7.34943 2.38045 7.93742C1.91792 8.52541 1.66663 9.25189 1.66701 9.99999C1.66552 10.472 1.7643 10.939 1.9568 11.3699C2.14931 11.8009 2.43115 12.1861 2.78368 12.5C2.86481 12.5779 2.96087 12.6386 3.06609 12.6784C3.17131 12.7182 3.28349 12.7363 3.39589 12.7316C3.50828 12.7269 3.61856 12.6995 3.72007 12.651C3.82158 12.6025 3.91222 12.534 3.98654 12.4495C4.06085 12.3651 4.1173 12.2664 4.15248 12.1596C4.18766 12.0527 4.20084 11.9399 4.19123 11.8278C4.18162 11.7157 4.14941 11.6067 4.09656 11.5074C4.0437 11.4081 3.97128 11.3206 3.88368 11.25C3.70893 11.0923 3.56957 10.8994 3.47477 10.6839C3.37997 10.4685 3.33188 10.2354 3.33368 9.99999C3.33368 9.55797 3.50927 9.13404 3.82183 8.82148C4.13439 8.50892 4.55831 8.33333 5.00034 8.33333C5.22136 8.33333 5.43332 8.24553 5.5896 8.08925C5.74588 7.93297 5.83368 7.72101 5.83368 7.49999C5.8358 6.51439 6.18725 5.56146 6.82557 4.81048C7.46389 4.05951 8.34775 3.55912 9.32013 3.39822C10.2925 3.23732 11.2905 3.42633 12.1366 3.93167C12.9828 4.437 13.6225 5.22594 13.942 6.15833C13.9896 6.30153 14.0753 6.4291 14.1897 6.52744C14.3042 6.62577 14.4433 6.69117 14.592 6.71666C15.1705 6.81644 15.6954 7.1166 16.0748 7.56455C16.4542 8.01249 16.6638 8.57966 16.667 9.16666C16.6798 9.78023 16.4594 10.3758 16.0503 10.8333C15.9173 10.999 15.8526 11.2092 15.8694 11.421C15.8862 11.6329 15.9833 11.8303 16.1408 11.9729C16.2983 12.1155 16.5043 12.1925 16.7168 12.1883C16.9292 12.184 17.132 12.0988 17.2837 11.95C17.7427 11.4255 18.0628 10.7942 18.2146 10.1139C18.3665 9.43362 18.3453 8.72613 18.1529 8.05619C17.9605 7.38625 17.6032 6.77527 17.1136 6.27919C16.624 5.78311 16.0177 5.41778 15.3503 5.21666V5.18333ZM13.3337 10.8333C13.1127 10.8333 12.9007 10.9211 12.7444 11.0774C12.5881 11.2337 12.5003 11.4456 12.5003 11.6667V15.8333C12.5003 16.0543 12.5881 16.2663 12.7444 16.4226C12.9007 16.5789 13.1127 16.6667 13.3337 16.6667C13.5547 16.6667 13.7667 16.5789 13.9229 16.4226C14.0792 16.2663 14.167 16.0543 14.167 15.8333V11.6667C14.167 11.4456 14.0792 11.2337 13.9229 11.0774C13.7667 10.9211 13.5547 10.8333 13.3337 10.8333Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              위험지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '594px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 100%이내예요.
          </Typography>
          <div style={{ position: 'absolute', display: 'flex', flexDirection: 'column' }}>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="2"
              height="102"
              viewBox="0 0 2 102"
              fill="none"
              style={{ marginLeft: '828px', marginTop: '15px' }}
            >
              <path d="M1 101L0.999996 1" stroke="#DFDFDF" stroke-linecap="round" />
            </svg>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-103px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {HopeMajor}
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                  marginLeft: '5px',
                }}
              >
                이중 지원자들 중
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-3px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {MyName}님의&nbsp;
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  // marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                학점
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                }}
              >
                은 상위
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '770px', marginTop: '2px' }}>
              <Typography
                size="heading1"
                style={{
                  color: '#D85888',
                  marginLeft: '100px',
                  lineHeight: '104.167%',
                }}
              >
                {myPercentile.toFixed(2)}
              </Typography>
              <Typography
                size="heading1"
                style={{
                  color: 'rgba(67, 67, 67, 0.80)',
                  fontWeight: '400',
                  lineHeight: '104.167%',
                  marginLeft: '10px',
                }}
              >
                %
              </Typography>
            </div>
          </div>
        </div>
      );

    case 'Dangerous':
      return (
        <div
          style={{
            position: 'relative',
            display: 'flex',
            alignItems: 'baseline',
            marginTop: '4px',
            marginLeft: '26px',
          }}
        >
          <svg xmlns="http://www.w3.org/2000/svg" width="253" height="149" viewBox="0 0 253 149" fill="none">
            <g filter="url(#filter0_d_3640_34505)">
              <mask id="path-1-inside-1_3640_34505" fill="white">
                <path d="M16 35C16 32.2386 18.2386 30 21 30H198C200.761 30 203 32.2386 203 35V74C203 76.7614 200.761 79 198 79H21C18.2386 79 16 76.7614 16 74V35Z" />
              </mask>
              <path
                d="M16 35C16 32.2386 18.2386 30 21 30H198C200.761 30 203 32.2386 203 35V74C203 76.7614 200.761 79 198 79H21C18.2386 79 16 76.7614 16 74V35Z"
                fill="white"
              />
              <path
                d="M21 31H198V29H21V31ZM202 35V74H204V35H202ZM198 78H21V80H198V78ZM17 74V35H15V74H17ZM21 78C18.7909 78 17 76.2091 17 74H15C15 77.3137 17.6863 80 21 80V78ZM202 74C202 76.2091 200.209 78 198 78V80C201.314 80 204 77.3137 204 74H202ZM198 31C200.209 31 202 32.7909 202 35H204C204 31.6863 201.314 29 198 29V31ZM21 29C17.6863 29 15 31.6863 15 35H17C17 32.7909 18.7909 31 21 31V29Z"
                fill="url(#paint0_linear_3640_34505)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34505)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34505"
                x="-34"
                y="0"
                width="287"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34505" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34505" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34505"
                x1="20"
                y1="54"
                x2="203"
                y2="54"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '64px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M4.70033 14.1667L4.10866 14.7583C3.95345 14.9145 3.86633 15.1257 3.86633 15.3458C3.86633 15.566 3.95345 15.7772 4.10866 15.9333C4.26479 16.0885 4.476 16.1757 4.69616 16.1757C4.91631 16.1757 5.12752 16.0885 5.28366 15.9333L5.87533 15.3417C6.01185 15.1822 6.08319 14.9772 6.07509 14.7674C6.06698 14.5577 5.98004 14.3588 5.83163 14.2104C5.68322 14.0619 5.48427 13.975 5.27454 13.9669C5.06481 13.9588 4.85974 14.0301 4.70033 14.1667ZM4.16699 9.99999C4.16699 9.77898 4.07919 9.56702 3.92291 9.41073C3.76663 9.25445 3.55467 9.16666 3.33366 9.16666H2.50033C2.27931 9.16666 2.06735 9.25445 1.91107 9.41073C1.75479 9.56702 1.66699 9.77898 1.66699 9.99999C1.66699 10.221 1.75479 10.433 1.91107 10.5892C2.06735 10.7455 2.27931 10.8333 2.50033 10.8333H3.33366C3.55467 10.8333 3.76663 10.7455 3.92291 10.5892C4.07919 10.433 4.16699 10.221 4.16699 9.99999ZM10.0003 4.16666C10.2213 4.16666 10.4333 4.07886 10.5896 3.92258C10.7459 3.7663 10.8337 3.55434 10.8337 3.33332V2.49999C10.8337 2.27898 10.7459 2.06701 10.5896 1.91073C10.4333 1.75445 10.2213 1.66666 10.0003 1.66666C9.77931 1.66666 9.56735 1.75445 9.41107 1.91073C9.25479 2.06701 9.16699 2.27898 9.16699 2.49999V3.33332C9.16699 3.55434 9.25479 3.7663 9.41107 3.92258C9.56735 4.07886 9.77931 4.16666 10.0003 4.16666ZM4.70033 5.87499C4.85554 6.02894 5.06504 6.11574 5.28366 6.11666C5.39333 6.11729 5.50205 6.09627 5.60358 6.0548C5.70511 6.01333 5.79746 5.95222 5.87533 5.87499C6.03054 5.71885 6.11765 5.50764 6.11765 5.28749C6.11765 5.06734 6.03054 4.85613 5.87533 4.69999L5.28366 4.10832C5.12424 3.9718 4.91918 3.90046 4.70945 3.90856C4.49972 3.91666 4.30077 4.00361 4.15236 4.15202C4.00394 4.30043 3.917 4.49938 3.9089 4.70911C3.9008 4.91884 3.97214 5.12391 4.10866 5.28332L4.70033 5.87499ZM14.7003 6.11666C14.9189 6.11574 15.1284 6.02894 15.2837 5.87499L15.8753 5.28332C15.9626 5.20862 16.0334 5.11669 16.0834 5.0133C16.1335 4.90991 16.1616 4.7973 16.166 4.68253C16.1704 4.56777 16.1511 4.45333 16.1092 4.34639C16.0673 4.23945 16.0037 4.14233 15.9225 4.06111C15.8413 3.9799 15.7442 3.91635 15.6373 3.87446C15.5303 3.83256 15.4159 3.81323 15.3011 3.81766C15.1863 3.82209 15.0737 3.8502 14.9704 3.90022C14.867 3.95024 14.775 4.02109 14.7003 4.10832L14.167 4.69999C14.0118 4.85613 13.9247 5.06734 13.9247 5.28749C13.9247 5.50764 14.0118 5.71885 14.167 5.87499C14.3139 6.02113 14.51 6.10728 14.717 6.11666H14.7003ZM17.5003 9.16666H16.667C16.446 9.16666 16.234 9.25445 16.0777 9.41073C15.9215 9.56702 15.8337 9.77898 15.8337 9.99999C15.8337 10.221 15.9215 10.433 16.0777 10.5892C16.234 10.7455 16.446 10.8333 16.667 10.8333H17.5003C17.7213 10.8333 17.9333 10.7455 18.0896 10.5892C18.2459 10.433 18.3337 10.221 18.3337 9.99999C18.3337 9.77898 18.2459 9.56702 18.0896 9.41073C17.9333 9.25445 17.7213 9.16666 17.5003 9.16666ZM10.0003 15.8333C9.77931 15.8333 9.56735 15.9211 9.41107 16.0774C9.25479 16.2337 9.16699 16.4456 9.16699 16.6667V17.5C9.16699 17.721 9.25479 17.933 9.41107 18.0892C9.56735 18.2455 9.77931 18.3333 10.0003 18.3333C10.2213 18.3333 10.4333 18.2455 10.5896 18.0892C10.7459 17.933 10.8337 17.721 10.8337 17.5V16.6667C10.8337 16.4456 10.7459 16.2337 10.5896 16.0774C10.4333 15.9211 10.2213 15.8333 10.0003 15.8333ZM15.3003 14.1667C15.142 14.0786 14.9593 14.0445 14.7799 14.0696C14.6005 14.0947 14.4341 14.1776 14.306 14.3057C14.1779 14.4338 14.095 14.6001 14.0699 14.7795C14.0449 14.959 14.0789 15.1417 14.167 15.3L14.7587 15.8917C14.9148 16.0469 15.126 16.134 15.3462 16.134C15.5663 16.134 15.7775 16.0469 15.9337 15.8917C16.0889 15.7355 16.176 15.5243 16.176 15.3042C16.176 15.084 16.0889 14.8728 15.9337 14.7167L15.3003 14.1667ZM10.0003 5.41666C9.09383 5.41666 8.20769 5.68546 7.45396 6.18909C6.70024 6.69271 6.11278 7.40853 5.76588 8.24602C5.41898 9.08352 5.32821 10.0051 5.50506 10.8942C5.68191 11.7832 6.11843 12.5999 6.75942 13.2409C7.40041 13.8819 8.21708 14.3184 9.10616 14.4953C9.99524 14.6721 10.9168 14.5813 11.7543 14.2344C12.5918 13.8875 13.3076 13.3001 13.8112 12.5464C14.3149 11.7926 14.5837 10.9065 14.5837 9.99999C14.5815 8.78509 14.0979 7.62058 13.2388 6.76152C12.3797 5.90245 11.2152 5.41886 10.0003 5.41666ZM10.0003 12.9167C9.42346 12.9167 8.85956 12.7456 8.37991 12.4251C7.90027 12.1046 7.52643 11.6491 7.30568 11.1161C7.08492 10.5832 7.02716 9.99675 7.1397 9.43098C7.25224 8.8652 7.53003 8.3455 7.93793 7.9376C8.34583 7.52969 8.86553 7.25191 9.43131 7.13937C9.99709 7.02683 10.5835 7.08459 11.1165 7.30534C11.6494 7.5261 12.105 7.89993 12.4254 8.37958C12.7459 8.85922 12.917 9.42313 12.917 9.99999C12.917 10.7735 12.6097 11.5154 12.0627 12.0624C11.5157 12.6094 10.7739 12.9167 10.0003 12.9167Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              매우안정
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '26px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 25%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="135"
            viewBox="0 0 296 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34487)">
              <mask id="path-1-inside-1_3640_34487" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M64 16C61.2386 16 59 18.2386 59 21V26.2265L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L59 37.7735V60C59 62.7614 61.2386 65 64 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H64Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M64 16C61.2386 16 59 18.2386 59 21V26.2265L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L59 37.7735V60C59 62.7614 61.2386 65 64 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H64Z"
                fill="white"
              />
              <path
                d="M59 26.2265L59.5 27.0925L60 26.8038V26.2265H59ZM50.5 31.134L51 32L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM59 37.7735H60V37.1962L59.5 36.9075L59 37.7735ZM60 21C60 18.7909 61.7909 17 64 17V15C60.6863 15 58 17.6863 58 21H60ZM60 26.2265V21H58V26.2265H60ZM58.5 25.3605L50 30.2679L51 32L59.5 27.0925L58.5 25.3605ZM50 30.2679C48.6667 31.0377 48.6667 32.9622 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L58.5 38.6395L59.5 36.9075L51 32L50 33.7321ZM60 60V37.7735H58V60H60ZM64 64C61.7909 64 60 62.2091 60 60H58C58 63.3137 60.6863 66 64 66V64ZM241 64H64V66H241V64ZM245 60C245 62.2091 243.209 64 241 64V66C244.314 66 247 63.3137 247 60H245ZM245 21V60H247V21H245ZM241 17C243.209 17 245 18.7909 245 21H247C247 17.6863 244.314 15 241 15V17ZM64 17H241V15H64V17Z"
                fill="url(#paint0_linear_3640_34487)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34487)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34487"
                x="0"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34487" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34487" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34487"
                x1="54.1925"
                y1="40"
                x2="246"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '244px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M14.717 6.95C14.9356 6.94908 15.1451 6.86229 15.3003 6.70833L15.892 6.11667C15.9792 6.04196 16.0501 5.95003 16.1001 5.84664C16.1501 5.74325 16.1782 5.63064 16.1827 5.51588C16.1871 5.40111 16.1678 5.28667 16.1259 5.17973C16.084 5.07279 16.0204 4.97567 15.9392 4.89446C15.858 4.81325 15.7609 4.7497 15.6539 4.7078C15.547 4.66591 15.4325 4.64657 15.3178 4.651C15.203 4.65543 15.0904 4.68354 14.987 4.73356C14.8836 4.78358 14.7917 4.85443 14.717 4.94167L14.167 5.53333C14.0118 5.68947 13.9247 5.90068 13.9247 6.12083C13.9247 6.34099 14.0118 6.5522 14.167 6.70833C14.3139 6.85447 14.51 6.94063 14.717 6.95ZM10.0003 5C10.2213 5 10.4333 4.9122 10.5896 4.75592C10.7459 4.59964 10.8337 4.38768 10.8337 4.16667V3.33333C10.8337 3.11232 10.7459 2.90036 10.5896 2.74408C10.4333 2.5878 10.2213 2.5 10.0003 2.5C9.77931 2.5 9.56735 2.5878 9.41107 2.74408C9.25479 2.90036 9.16699 3.11232 9.16699 3.33333V4.16667C9.16699 4.38768 9.25479 4.59964 9.41107 4.75592C9.56735 4.9122 9.77931 5 10.0003 5ZM3.33366 10H2.50033C2.27931 10 2.06735 10.0878 1.91107 10.2441C1.75479 10.4004 1.66699 10.6123 1.66699 10.8333C1.66699 11.0543 1.75479 11.2663 1.91107 11.4226C2.06735 11.5789 2.27931 11.6667 2.50033 11.6667H3.33366C3.55467 11.6667 3.76663 11.5789 3.92291 11.4226C4.07919 11.2663 4.16699 11.0543 4.16699 10.8333C4.16699 10.6123 4.07919 10.4004 3.92291 10.2441C3.76663 10.0878 3.55467 10 3.33366 10ZM4.70033 6.70833C4.85554 6.86229 5.06504 6.94908 5.28366 6.95C5.39333 6.95063 5.50205 6.92961 5.60358 6.88814C5.70511 6.84667 5.79746 6.78557 5.87533 6.70833C6.03054 6.5522 6.11765 6.34099 6.11765 6.12083C6.11765 5.90068 6.03054 5.68947 5.87533 5.53333L5.28366 4.94167C5.12424 4.80514 4.91918 4.73381 4.70945 4.74191C4.49972 4.75001 4.30077 4.83695 4.15236 4.98536C4.00394 5.13378 3.917 5.33273 3.9089 5.54246C3.9008 5.75219 3.97214 5.95725 4.10866 6.11667L4.70033 6.70833ZM17.5003 10H16.667C16.446 10 16.234 10.0878 16.0777 10.2441C15.9215 10.4004 15.8337 10.6123 15.8337 10.8333C15.8337 11.0543 15.9215 11.2663 16.0777 11.4226C16.234 11.5789 16.446 11.6667 16.667 11.6667H17.5003C17.7213 11.6667 17.9333 11.5789 18.0896 11.4226C18.2459 11.2663 18.3337 11.0543 18.3337 10.8333C18.3337 10.6123 18.2459 10.4004 18.0896 10.2441C17.9333 10.0878 17.7213 10 17.5003 10ZM9.16699 15.8333H6.66699C6.44598 15.8333 6.23402 15.9211 6.07774 16.0774C5.92146 16.2337 5.83366 16.4457 5.83366 16.6667C5.83366 16.8877 5.92146 17.0996 6.07774 17.2559C6.23402 17.4122 6.44598 17.5 6.66699 17.5H9.16699C9.38801 17.5 9.59997 17.4122 9.75625 17.2559C9.91253 17.0996 10.0003 16.8877 10.0003 16.6667C10.0003 16.4457 9.91253 16.2337 9.75625 16.0774C9.59997 15.9211 9.38801 15.8333 9.16699 15.8333ZM15.0003 12.5H14.267C14.4775 11.9696 14.5849 11.404 14.5837 10.8333C14.5837 9.61776 14.1008 8.45197 13.2412 7.59243C12.3817 6.73289 11.2159 6.25 10.0003 6.25C8.78475 6.25 7.61896 6.73289 6.75942 7.59243C5.89988 8.45197 5.41699 9.61776 5.41699 10.8333C5.41572 11.404 5.52319 11.9696 5.73366 12.5H5.00033C4.77931 12.5 4.56735 12.5878 4.41107 12.7441C4.25479 12.9004 4.16699 13.1123 4.16699 13.3333C4.16699 13.5543 4.25479 13.7663 4.41107 13.9226C4.56735 14.0789 4.77931 14.1667 5.00033 14.1667H15.0003C15.2213 14.1667 15.4333 14.0789 15.5896 13.9226C15.7459 13.7663 15.8337 13.5543 15.8337 13.3333C15.8337 13.1123 15.7459 12.9004 15.5896 12.7441C15.4333 12.5878 15.2213 12.5 15.0003 12.5ZM12.3753 12.5H7.62533C7.27522 12.0146 7.08581 11.4318 7.08366 10.8333C7.08366 10.0598 7.39095 9.31792 7.93793 8.77094C8.48491 8.22396 9.22678 7.91667 10.0003 7.91667C10.7739 7.91667 11.5157 8.22396 12.0627 8.77094C12.6097 9.31792 12.917 10.0598 12.917 10.8333C12.9148 11.4318 12.7254 12.0146 12.3753 12.5ZM13.3337 15.8333H12.5003C12.2793 15.8333 12.0674 15.9211 11.9111 16.0774C11.7548 16.2337 11.667 16.4457 11.667 16.6667C11.667 16.8877 11.7548 17.0996 11.9111 17.2559C12.0674 17.4122 12.2793 17.5 12.5003 17.5H13.3337C13.5547 17.5 13.7666 17.4122 13.9229 17.2559C14.0792 17.0996 14.167 16.8877 14.167 16.6667C14.167 16.4457 14.0792 16.2337 13.9229 16.0774C13.7666 15.9211 13.5547 15.8333 13.3337 15.8333Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              안정지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '214px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 50%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="149"
            viewBox="0 0 296 149"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34513)">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M65 30C62.2386 30 60 32.2386 60 35V39.6491L50.5 45.134C49.8333 45.5189 49.8333 46.4811 50.5 46.866L60 52.3509V74C60 76.7614 62.2386 79 65 79H241C243.761 79 246 76.7614 246 74V35C246 32.2386 243.761 30 241 30H65Z"
                fill="#D85888"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34513"
                x="0"
                y="0"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.847059 0 0 0 0 0.345098 0 0 0 0 0.533333 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34513" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34513" result="shape" />
              </filter>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '434px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M16.2253 8.78333C15.8304 7.90479 15.1901 7.15902 14.3815 6.63569C13.5728 6.11235 12.6302 5.83373 11.667 5.83333C11.2762 5.83649 10.8873 5.88685 10.5087 5.98333C10.0343 5.31378 9.37286 4.79919 8.60722 4.5041C7.84158 4.209 7.00585 4.14653 6.20485 4.32453C5.40385 4.50253 4.67324 4.91307 4.10464 5.50467C3.53604 6.09626 3.15478 6.84257 3.00866 7.65C2.46344 7.84628 2.00334 8.22587 1.70703 8.72386C1.41072 9.22185 1.29661 9.8073 1.3842 10.3801C1.4718 10.9529 1.75566 11.4775 2.18725 11.8642C2.61885 12.2509 3.17136 12.4756 3.75032 12.5H4.58366C4.57497 12.6388 4.57497 12.7779 4.58366 12.9167C4.58366 13.6902 4.89095 14.4321 5.43793 14.9791C5.98491 15.526 6.72678 15.8333 7.50032 15.8333H15.142C16.0039 15.8332 16.8373 15.5245 17.4913 14.9632C18.1454 14.4019 18.5769 13.6249 18.7078 12.773C18.8387 11.9211 18.6604 11.0505 18.205 10.3187C17.7497 9.58689 17.0474 9.04225 16.2253 8.78333ZM3.75032 10.8333C3.52931 10.8333 3.31735 10.7455 3.16107 10.5893C3.00479 10.433 2.91699 10.221 2.91699 10C2.91699 9.77898 3.00479 9.56702 3.16107 9.41074C3.31735 9.25446 3.52931 9.16666 3.75032 9.16666C3.97134 9.16666 4.1833 9.07887 4.33958 8.92259C4.49586 8.76631 4.58366 8.55434 4.58366 8.33333C4.58366 7.67029 4.84705 7.0344 5.31589 6.56556C5.78473 6.09672 6.42062 5.83333 7.08366 5.83333C7.43314 5.83521 7.77835 5.91034 8.097 6.05388C8.41565 6.19741 8.70067 6.40617 8.93366 6.66666C8.34226 7.05146 7.839 7.55706 7.45695 8.15024C7.0749 8.74342 6.82273 9.41074 6.71699 10.1083C6.24597 10.241 5.81603 10.4904 5.46699 10.8333H3.75032ZM15.142 14.1667H7.50032C7.1688 14.1667 6.85086 14.035 6.61644 13.8005C6.38202 13.5661 6.25032 13.2482 6.25032 12.9167C6.25032 12.5851 6.38202 12.2672 6.61644 12.0328C6.85086 11.7984 7.1688 11.6667 7.50032 11.6667C7.72134 11.6667 7.9333 11.5789 8.08958 11.4226C8.24586 11.2663 8.33366 11.0543 8.33366 10.8333C8.33723 10.0464 8.61909 9.28613 9.12936 8.68706C9.63962 8.08798 10.3454 7.68875 11.1217 7.56003C11.898 7.43131 12.6949 7.58139 13.3712 7.98372C14.0475 8.38605 14.5596 9.01468 14.817 9.75833C14.8646 9.90153 14.9503 10.0291 15.0647 10.1274C15.1792 10.2258 15.3182 10.2912 15.467 10.3167C15.94 10.4051 16.3633 10.666 16.6549 11.0488C16.9464 11.4317 17.0854 11.9091 17.0449 12.3886C17.0045 12.8681 16.7874 13.3155 16.4358 13.644C16.0842 13.9725 15.6231 14.1588 15.142 14.1667Z"
                fill="white"
              />
            </svg>
            <Typography size="bodyText" style={{ color: 'var(--White, #FFF)', marginLeft: '10px' }}>
              소신지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: 'rgba(216, 88, 136, 0.80)',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '404px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 75%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="264"
            height="135"
            viewBox="0 0 264 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34475)">
              <mask id="path-1-inside-1_3640_34475" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M66 16C63.2386 16 61 18.2386 61 21L61 25.0718L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L61 38.9282L61 60C61 62.7614 63.2386 65 66 65H243C245.761 65 248 62.7614 248 60V21C248 18.2386 245.761 16 243 16H66Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M66 16C63.2386 16 61 18.2386 61 21L61 25.0718L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L61 38.9282L61 60C61 62.7614 63.2386 65 66 65H243C245.761 65 248 62.7614 248 60V21C248 18.2386 245.761 16 243 16H66Z"
                fill="white"
              />
              <path
                d="M61 21H62H61ZM61 25.0718L61.5 25.9378L62 25.6491V25.0718H61ZM50.5 31.134L51 32H51L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM61 38.9282H62V38.3509L61.5 38.0622L61 38.9282ZM61 60H62H61ZM62 21C62 18.7909 63.7909 17 66 17V15C62.6863 15 60 17.6863 60 21H62ZM62 25.0718L62 21H60L60 25.0718H62ZM60.5 24.2058L50 30.268L51 32L61.5 25.9378L60.5 24.2058ZM50 30.2679C48.6667 31.0378 48.6667 32.9623 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L60.5 39.7942L61.5 38.0622L51 32L50 33.7321ZM62 60L62 38.9282H60L60 60H62ZM66 64C63.7909 64 62 62.2091 62 60H60C60 63.3137 62.6863 66 66 66V64ZM243 64H66V66H243V64ZM247 60C247 62.2091 245.209 64 243 64V66C246.314 66 249 63.3137 249 60H247ZM247 21V60H249V21H247ZM243 17C245.209 17 247 18.7909 247 21H249C249 17.6863 246.314 15 243 15V17ZM66 17H243V15H66V17Z"
                fill="url(#paint0_linear_3640_34475)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34475)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34475"
                x="0"
                y="-14"
                width="298"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34475" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34475" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34475"
                x1="54.2353"
                y1="40"
                x2="248"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '624px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M6.66701 10.8333C6.44599 10.8333 6.23403 10.9211 6.07775 11.0774C5.92147 11.2337 5.83368 11.4456 5.83368 11.6667V15.8333C5.83368 16.0543 5.92147 16.2663 6.07775 16.4226C6.23403 16.5789 6.44599 16.6667 6.66701 16.6667C6.88802 16.6667 7.09998 16.5789 7.25626 16.4226C7.41254 16.2663 7.50034 16.0543 7.50034 15.8333V11.6667C7.50034 11.4456 7.41254 11.2337 7.25626 11.0774C7.09998 10.9211 6.88802 10.8333 6.66701 10.8333ZM10.0003 9.16666C9.77933 9.16666 9.56737 9.25446 9.41109 9.41074C9.25481 9.56702 9.16701 9.77898 9.16701 9.99999V17.5C9.16701 17.721 9.25481 17.933 9.41109 18.0893C9.56737 18.2455 9.77933 18.3333 10.0003 18.3333C10.2214 18.3333 10.4333 18.2455 10.5896 18.0893C10.7459 17.933 10.8337 17.721 10.8337 17.5V9.99999C10.8337 9.77898 10.7459 9.56702 10.5896 9.41074C10.4333 9.25446 10.2214 9.16666 10.0003 9.16666ZM15.3503 5.18333C14.8412 4.01333 13.9624 3.04256 12.8487 2.41977C11.7351 1.79697 10.4479 1.55652 9.18448 1.73525C7.92107 1.91398 6.75111 2.50204 5.85389 3.40931C4.95666 4.31657 4.38167 5.49301 4.21701 6.75833C3.48985 6.93413 2.84298 7.34943 2.38045 7.93742C1.91792 8.52541 1.66663 9.25189 1.66701 9.99999C1.66552 10.472 1.7643 10.939 1.9568 11.3699C2.14931 11.8009 2.43115 12.1861 2.78368 12.5C2.86481 12.5779 2.96087 12.6386 3.06609 12.6784C3.17131 12.7182 3.28349 12.7363 3.39589 12.7316C3.50828 12.7269 3.61856 12.6995 3.72007 12.651C3.82158 12.6025 3.91222 12.534 3.98654 12.4495C4.06085 12.3651 4.1173 12.2664 4.15248 12.1596C4.18766 12.0527 4.20084 11.9399 4.19123 11.8278C4.18162 11.7157 4.14941 11.6067 4.09656 11.5074C4.0437 11.4081 3.97128 11.3206 3.88368 11.25C3.70893 11.0923 3.56957 10.8994 3.47477 10.6839C3.37997 10.4685 3.33188 10.2354 3.33368 9.99999C3.33368 9.55797 3.50927 9.13404 3.82183 8.82148C4.13439 8.50892 4.55831 8.33333 5.00034 8.33333C5.22136 8.33333 5.43332 8.24553 5.5896 8.08925C5.74588 7.93297 5.83368 7.72101 5.83368 7.49999C5.8358 6.51439 6.18725 5.56146 6.82557 4.81048C7.46389 4.05951 8.34775 3.55912 9.32013 3.39822C10.2925 3.23732 11.2905 3.42633 12.1366 3.93167C12.9828 4.437 13.6225 5.22594 13.942 6.15833C13.9896 6.30153 14.0753 6.4291 14.1897 6.52744C14.3042 6.62577 14.4433 6.69117 14.592 6.71666C15.1705 6.81644 15.6954 7.1166 16.0748 7.56455C16.4542 8.01249 16.6638 8.57966 16.667 9.16666C16.6798 9.78023 16.4594 10.3758 16.0503 10.8333C15.9173 10.999 15.8526 11.2092 15.8694 11.421C15.8862 11.6329 15.9833 11.8303 16.1408 11.9729C16.2983 12.1155 16.5043 12.1925 16.7168 12.1883C16.9292 12.184 17.132 12.0988 17.2837 11.95C17.7427 11.4255 18.0628 10.7942 18.2146 10.1139C18.3665 9.43362 18.3453 8.72613 18.1529 8.05619C17.9605 7.38625 17.6032 6.77527 17.1136 6.27919C16.624 5.78311 16.0177 5.41778 15.3503 5.21666V5.18333ZM13.3337 10.8333C13.1127 10.8333 12.9007 10.9211 12.7444 11.0774C12.5881 11.2337 12.5003 11.4456 12.5003 11.6667V15.8333C12.5003 16.0543 12.5881 16.2663 12.7444 16.4226C12.9007 16.5789 13.1127 16.6667 13.3337 16.6667C13.5547 16.6667 13.7667 16.5789 13.9229 16.4226C14.0792 16.2663 14.167 16.0543 14.167 15.8333V11.6667C14.167 11.4456 14.0792 11.2337 13.9229 11.0774C13.7667 10.9211 13.5547 10.8333 13.3337 10.8333Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              위험지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '594px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 100%이내예요.
          </Typography>
          <div style={{ position: 'absolute', display: 'flex', flexDirection: 'column' }}>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="2"
              height="102"
              viewBox="0 0 2 102"
              fill="none"
              style={{ marginLeft: '828px', marginTop: '15px' }}
            >
              <path d="M1 101L0.999996 1" stroke="#DFDFDF" stroke-linecap="round" />
            </svg>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-103px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {HopeMajor}
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                  marginLeft: '5px',
                }}
              >
                이중 지원자들 중
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-3px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {MyName}님의&nbsp;
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  // marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                학점
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                }}
              >
                은 상위
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '770px', marginTop: '2px' }}>
              <Typography
                size="heading1"
                style={{
                  color: '#D85888',
                  marginLeft: '100px',
                  lineHeight: '104.167%',
                }}
              >
                {myPercentile.toFixed(2)}
              </Typography>
              <Typography
                size="heading1"
                style={{
                  color: 'rgba(67, 67, 67, 0.80)',
                  fontWeight: '400',
                  lineHeight: '104.167%',
                  marginLeft: '10px',
                }}
              >
                %
              </Typography>
            </div>
          </div>
        </div>
      );

    case 'VeryDangerous':
      return (
        <div
          style={{
            position: 'relative',
            display: 'flex',
            alignItems: 'baseline',
            marginTop: '4px',
            marginLeft: '26px',
          }}
        >
          <svg xmlns="http://www.w3.org/2000/svg" width="253" height="149" viewBox="0 0 253 149" fill="none">
            <g filter="url(#filter0_d_3640_34534)">
              <mask id="path-1-inside-1_3640_34534" fill="white">
                <path d="M16 35C16 32.2386 18.2386 30 21 30H198C200.761 30 203 32.2386 203 35V74C203 76.7614 200.761 79 198 79H21C18.2386 79 16 76.7614 16 74V35Z" />
              </mask>
              <path
                d="M16 35C16 32.2386 18.2386 30 21 30H198C200.761 30 203 32.2386 203 35V74C203 76.7614 200.761 79 198 79H21C18.2386 79 16 76.7614 16 74V35Z"
                fill="white"
              />
              <path
                d="M21 31H198V29H21V31ZM202 35V74H204V35H202ZM198 78H21V80H198V78ZM17 74V35H15V74H17ZM21 78C18.7909 78 17 76.2091 17 74H15C15 77.3137 17.6863 80 21 80V78ZM202 74C202 76.2091 200.209 78 198 78V80C201.314 80 204 77.3137 204 74H202ZM198 31C200.209 31 202 32.7909 202 35H204C204 31.6863 201.314 29 198 29V31ZM21 29C17.6863 29 15 31.6863 15 35H17C17 32.7909 18.7909 31 21 31V29Z"
                fill="url(#paint0_linear_3640_34534)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34534)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34534"
                x="-34"
                y="0"
                width="287"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34534" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34534" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34534"
                x1="20"
                y1="54"
                x2="203"
                y2="54"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '64px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M4.70033 14.1667L4.10866 14.7583C3.95345 14.9145 3.86633 15.1257 3.86633 15.3458C3.86633 15.566 3.95345 15.7772 4.10866 15.9333C4.26479 16.0885 4.476 16.1757 4.69616 16.1757C4.91631 16.1757 5.12752 16.0885 5.28366 15.9333L5.87533 15.3417C6.01185 15.1823 6.08319 14.9772 6.07509 14.7675C6.06698 14.5577 5.98004 14.3588 5.83163 14.2104C5.68322 14.062 5.48427 13.975 5.27454 13.9669C5.06481 13.9588 4.85974 14.0302 4.70033 14.1667ZM4.16699 10C4.16699 9.77899 4.07919 9.56703 3.92291 9.41075C3.76663 9.25447 3.55467 9.16667 3.33366 9.16667H2.50033C2.27931 9.16667 2.06735 9.25447 1.91107 9.41075C1.75479 9.56703 1.66699 9.77899 1.66699 10C1.66699 10.221 1.75479 10.433 1.91107 10.5893C2.06735 10.7455 2.27931 10.8333 2.50033 10.8333H3.33366C3.55467 10.8333 3.76663 10.7455 3.92291 10.5893C4.07919 10.433 4.16699 10.221 4.16699 10ZM10.0003 4.16667C10.2213 4.16667 10.4333 4.07887 10.5896 3.92259C10.7459 3.76631 10.8337 3.55435 10.8337 3.33334V2.50001C10.8337 2.27899 10.7459 2.06703 10.5896 1.91075C10.4333 1.75447 10.2213 1.66667 10.0003 1.66667C9.77931 1.66667 9.56735 1.75447 9.41107 1.91075C9.25479 2.06703 9.16699 2.27899 9.16699 2.50001V3.33334C9.16699 3.55435 9.25479 3.76631 9.41107 3.92259C9.56735 4.07887 9.77931 4.16667 10.0003 4.16667ZM4.70033 5.87501C4.85554 6.02896 5.06504 6.11575 5.28366 6.11667C5.39333 6.11731 5.50205 6.09629 5.60358 6.05481C5.70511 6.01334 5.79746 5.95224 5.87533 5.87501C6.03054 5.71887 6.11765 5.50766 6.11765 5.28751C6.11765 5.06735 6.03054 4.85614 5.87533 4.70001L5.28366 4.10834C5.12424 3.97182 4.91918 3.90048 4.70945 3.90858C4.49972 3.91668 4.30077 4.00362 4.15236 4.15204C4.00394 4.30045 3.917 4.4994 3.9089 4.70913C3.9008 4.91886 3.97214 5.12392 4.10866 5.28334L4.70033 5.87501ZM14.7003 6.11667C14.9189 6.11575 15.1284 6.02896 15.2837 5.87501L15.8753 5.28334C15.9626 5.20863 16.0334 5.1167 16.0834 5.01331C16.1335 4.90993 16.1616 4.79732 16.166 4.68255C16.1704 4.56778 16.1511 4.45334 16.1092 4.3464C16.0673 4.23947 16.0037 4.14234 15.9225 4.06113C15.8413 3.97992 15.7442 3.91637 15.6373 3.87447C15.5303 3.83258 15.4159 3.81324 15.3011 3.81767C15.1863 3.82211 15.0737 3.85021 14.9704 3.90023C14.867 3.95025 14.775 4.0211 14.7003 4.10834L14.167 4.70001C14.0118 4.85614 13.9247 5.06735 13.9247 5.28751C13.9247 5.50766 14.0118 5.71887 14.167 5.87501C14.3139 6.02114 14.51 6.1073 14.717 6.11667H14.7003ZM17.5003 9.16667H16.667C16.446 9.16667 16.234 9.25447 16.0777 9.41075C15.9215 9.56703 15.8337 9.77899 15.8337 10C15.8337 10.221 15.9215 10.433 16.0777 10.5893C16.234 10.7455 16.446 10.8333 16.667 10.8333H17.5003C17.7213 10.8333 17.9333 10.7455 18.0896 10.5893C18.2459 10.433 18.3337 10.221 18.3337 10C18.3337 9.77899 18.2459 9.56703 18.0896 9.41075C17.9333 9.25447 17.7213 9.16667 17.5003 9.16667ZM10.0003 15.8333C9.77931 15.8333 9.56735 15.9211 9.41107 16.0774C9.25479 16.2337 9.16699 16.4457 9.16699 16.6667V17.5C9.16699 17.721 9.25479 17.933 9.41107 18.0893C9.56735 18.2455 9.77931 18.3333 10.0003 18.3333C10.2213 18.3333 10.4333 18.2455 10.5896 18.0893C10.7459 17.933 10.8337 17.721 10.8337 17.5V16.6667C10.8337 16.4457 10.7459 16.2337 10.5896 16.0774C10.4333 15.9211 10.2213 15.8333 10.0003 15.8333ZM15.3003 14.1667C15.142 14.0786 14.9593 14.0445 14.7799 14.0696C14.6005 14.0947 14.4341 14.1776 14.306 14.3057C14.1779 14.4338 14.095 14.6001 14.0699 14.7796C14.0449 14.959 14.0789 15.1417 14.167 15.3L14.7587 15.8917C14.9148 16.0469 15.126 16.134 15.3462 16.134C15.5663 16.134 15.7775 16.0469 15.9337 15.8917C16.0889 15.7355 16.176 15.5243 16.176 15.3042C16.176 15.084 16.0889 14.8728 15.9337 14.7167L15.3003 14.1667ZM10.0003 5.41667C9.09383 5.41667 8.20769 5.68548 7.45396 6.1891C6.70024 6.69273 6.11278 7.40854 5.76588 8.24604C5.41898 9.08353 5.32821 10.0051 5.50506 10.8942C5.68191 11.7832 6.11843 12.5999 6.75942 13.2409C7.40041 13.8819 8.21708 14.3184 9.10616 14.4953C9.99524 14.6721 10.9168 14.5814 11.7543 14.2345C12.5918 13.8876 13.3076 13.3001 13.8112 12.5464C14.3149 11.7926 14.5837 10.9065 14.5837 10C14.5815 8.78511 14.0979 7.6206 13.2388 6.76153C12.3797 5.90247 11.2152 5.41887 10.0003 5.41667ZM10.0003 12.9167C9.42346 12.9167 8.85956 12.7456 8.37991 12.4251C7.90027 12.1046 7.52643 11.6491 7.30568 11.1162C7.08492 10.5832 7.02716 9.99677 7.1397 9.43099C7.25224 8.86521 7.53003 8.34551 7.93793 7.93761C8.34583 7.52971 8.86553 7.25192 9.43131 7.13938C9.99709 7.02684 10.5835 7.0846 11.1165 7.30536C11.6494 7.52611 12.105 7.89995 12.4254 8.37959C12.7459 8.85924 12.917 9.42314 12.917 10C12.917 10.7736 12.6097 11.5154 12.0627 12.0624C11.5157 12.6094 10.7739 12.9167 10.0003 12.9167Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              매우안정
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '26px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 25%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="135"
            viewBox="0 0 296 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34487)">
              <mask id="path-1-inside-1_3640_34487" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M64 16C61.2386 16 59 18.2386 59 21V26.2265L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L59 37.7735V60C59 62.7614 61.2386 65 64 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H64Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M64 16C61.2386 16 59 18.2386 59 21V26.2265L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L59 37.7735V60C59 62.7614 61.2386 65 64 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H64Z"
                fill="white"
              />
              <path
                d="M59 26.2265L59.5 27.0925L60 26.8038V26.2265H59ZM50.5 31.134L51 32L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM59 37.7735H60V37.1962L59.5 36.9075L59 37.7735ZM60 21C60 18.7909 61.7909 17 64 17V15C60.6863 15 58 17.6863 58 21H60ZM60 26.2265V21H58V26.2265H60ZM58.5 25.3605L50 30.2679L51 32L59.5 27.0925L58.5 25.3605ZM50 30.2679C48.6667 31.0377 48.6667 32.9622 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L58.5 38.6395L59.5 36.9075L51 32L50 33.7321ZM60 60V37.7735H58V60H60ZM64 64C61.7909 64 60 62.2091 60 60H58C58 63.3137 60.6863 66 64 66V64ZM241 64H64V66H241V64ZM245 60C245 62.2091 243.209 64 241 64V66C244.314 66 247 63.3137 247 60H245ZM245 21V60H247V21H245ZM241 17C243.209 17 245 18.7909 245 21H247C247 17.6863 244.314 15 241 15V17ZM64 17H241V15H64V17Z"
                fill="url(#paint0_linear_3640_34487)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34487)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34487"
                x="0"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34487" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34487" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34487"
                x1="54.1925"
                y1="40"
                x2="246"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '244px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M14.717 6.95C14.9356 6.94908 15.1451 6.86229 15.3003 6.70833L15.892 6.11667C15.9792 6.04196 16.0501 5.95003 16.1001 5.84664C16.1501 5.74325 16.1782 5.63064 16.1827 5.51588C16.1871 5.40111 16.1678 5.28667 16.1259 5.17973C16.084 5.07279 16.0204 4.97567 15.9392 4.89446C15.858 4.81325 15.7609 4.7497 15.6539 4.7078C15.547 4.66591 15.4325 4.64657 15.3178 4.651C15.203 4.65543 15.0904 4.68354 14.987 4.73356C14.8836 4.78358 14.7917 4.85443 14.717 4.94167L14.167 5.53333C14.0118 5.68947 13.9247 5.90068 13.9247 6.12083C13.9247 6.34099 14.0118 6.5522 14.167 6.70833C14.3139 6.85447 14.51 6.94063 14.717 6.95ZM10.0003 5C10.2213 5 10.4333 4.9122 10.5896 4.75592C10.7459 4.59964 10.8337 4.38768 10.8337 4.16667V3.33333C10.8337 3.11232 10.7459 2.90036 10.5896 2.74408C10.4333 2.5878 10.2213 2.5 10.0003 2.5C9.77931 2.5 9.56735 2.5878 9.41107 2.74408C9.25479 2.90036 9.16699 3.11232 9.16699 3.33333V4.16667C9.16699 4.38768 9.25479 4.59964 9.41107 4.75592C9.56735 4.9122 9.77931 5 10.0003 5ZM3.33366 10H2.50033C2.27931 10 2.06735 10.0878 1.91107 10.2441C1.75479 10.4004 1.66699 10.6123 1.66699 10.8333C1.66699 11.0543 1.75479 11.2663 1.91107 11.4226C2.06735 11.5789 2.27931 11.6667 2.50033 11.6667H3.33366C3.55467 11.6667 3.76663 11.5789 3.92291 11.4226C4.07919 11.2663 4.16699 11.0543 4.16699 10.8333C4.16699 10.6123 4.07919 10.4004 3.92291 10.2441C3.76663 10.0878 3.55467 10 3.33366 10ZM4.70033 6.70833C4.85554 6.86229 5.06504 6.94908 5.28366 6.95C5.39333 6.95063 5.50205 6.92961 5.60358 6.88814C5.70511 6.84667 5.79746 6.78557 5.87533 6.70833C6.03054 6.5522 6.11765 6.34099 6.11765 6.12083C6.11765 5.90068 6.03054 5.68947 5.87533 5.53333L5.28366 4.94167C5.12424 4.80514 4.91918 4.73381 4.70945 4.74191C4.49972 4.75001 4.30077 4.83695 4.15236 4.98536C4.00394 5.13378 3.917 5.33273 3.9089 5.54246C3.9008 5.75219 3.97214 5.95725 4.10866 6.11667L4.70033 6.70833ZM17.5003 10H16.667C16.446 10 16.234 10.0878 16.0777 10.2441C15.9215 10.4004 15.8337 10.6123 15.8337 10.8333C15.8337 11.0543 15.9215 11.2663 16.0777 11.4226C16.234 11.5789 16.446 11.6667 16.667 11.6667H17.5003C17.7213 11.6667 17.9333 11.5789 18.0896 11.4226C18.2459 11.2663 18.3337 11.0543 18.3337 10.8333C18.3337 10.6123 18.2459 10.4004 18.0896 10.2441C17.9333 10.0878 17.7213 10 17.5003 10ZM9.16699 15.8333H6.66699C6.44598 15.8333 6.23402 15.9211 6.07774 16.0774C5.92146 16.2337 5.83366 16.4457 5.83366 16.6667C5.83366 16.8877 5.92146 17.0996 6.07774 17.2559C6.23402 17.4122 6.44598 17.5 6.66699 17.5H9.16699C9.38801 17.5 9.59997 17.4122 9.75625 17.2559C9.91253 17.0996 10.0003 16.8877 10.0003 16.6667C10.0003 16.4457 9.91253 16.2337 9.75625 16.0774C9.59997 15.9211 9.38801 15.8333 9.16699 15.8333ZM15.0003 12.5H14.267C14.4775 11.9696 14.5849 11.404 14.5837 10.8333C14.5837 9.61776 14.1008 8.45197 13.2412 7.59243C12.3817 6.73289 11.2159 6.25 10.0003 6.25C8.78475 6.25 7.61896 6.73289 6.75942 7.59243C5.89988 8.45197 5.41699 9.61776 5.41699 10.8333C5.41572 11.404 5.52319 11.9696 5.73366 12.5H5.00033C4.77931 12.5 4.56735 12.5878 4.41107 12.7441C4.25479 12.9004 4.16699 13.1123 4.16699 13.3333C4.16699 13.5543 4.25479 13.7663 4.41107 13.9226C4.56735 14.0789 4.77931 14.1667 5.00033 14.1667H15.0003C15.2213 14.1667 15.4333 14.0789 15.5896 13.9226C15.7459 13.7663 15.8337 13.5543 15.8337 13.3333C15.8337 13.1123 15.7459 12.9004 15.5896 12.7441C15.4333 12.5878 15.2213 12.5 15.0003 12.5ZM12.3753 12.5H7.62533C7.27522 12.0146 7.08581 11.4318 7.08366 10.8333C7.08366 10.0598 7.39095 9.31792 7.93793 8.77094C8.48491 8.22396 9.22678 7.91667 10.0003 7.91667C10.7739 7.91667 11.5157 8.22396 12.0627 8.77094C12.6097 9.31792 12.917 10.0598 12.917 10.8333C12.9148 11.4318 12.7254 12.0146 12.3753 12.5ZM13.3337 15.8333H12.5003C12.2793 15.8333 12.0674 15.9211 11.9111 16.0774C11.7548 16.2337 11.667 16.4457 11.667 16.6667C11.667 16.8877 11.7548 17.0996 11.9111 17.2559C12.0674 17.4122 12.2793 17.5 12.5003 17.5H13.3337C13.5547 17.5 13.7666 17.4122 13.9229 17.2559C14.0792 17.0996 14.167 16.8877 14.167 16.6667C14.167 16.4457 14.0792 16.2337 13.9229 16.0774C13.7666 15.9211 13.5547 15.8333 13.3337 15.8333Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              안정지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '214px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 50%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="296"
            height="135"
            viewBox="0 0 296 135"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34481)">
              <mask id="path-1-inside-1_3640_34481" fill="white">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M65 16C62.2386 16 60 18.2386 60 21V25.6491L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L60 38.3509V60C60 62.7614 62.2386 65 65 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H65Z"
                />
              </mask>
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M65 16C62.2386 16 60 18.2386 60 21V25.6491L50.5 31.134C49.8333 31.5189 49.8333 32.4811 50.5 32.866L60 38.3509V60C60 62.7614 62.2386 65 65 65H241C243.761 65 246 62.7614 246 60V21C246 18.2386 243.761 16 241 16H65Z"
                fill="white"
              />
              <path
                d="M60 25.6491L60.5 26.5152L61 26.2265V25.6491H60ZM50.5 31.134L51 32L50.5 31.134ZM50.5 32.866L50 33.732L50 33.7321L50.5 32.866ZM60 38.3509H61V37.7735L60.5 37.4848L60 38.3509ZM61 21C61 18.7909 62.7909 17 65 17V15C61.6863 15 59 17.6863 59 21H61ZM61 25.6491V21H59V25.6491H61ZM59.5 24.7831L50 30.2679L51 32L60.5 26.5152L59.5 24.7831ZM50 30.2679C48.6667 31.0378 48.6667 32.9623 50 33.732L51 32L51 32L50 30.2679ZM50 33.7321L59.5 39.2169L60.5 37.4848L51 32L50 33.7321ZM61 60V38.3509H59V60H61ZM65 64C62.7909 64 61 62.2091 61 60H59C59 63.3137 61.6863 66 65 66V64ZM241 64H65V66H241V64ZM245 60C245 62.2091 243.209 64 241 64V66C244.314 66 247 63.3137 247 60H245ZM245 21V60H247V21H245ZM241 17C243.209 17 245 18.7909 245 21H247C247 17.6863 244.314 15 241 15V17ZM65 17H241V15H65V17Z"
                fill="url(#paint0_linear_3640_34481)"
                fill-opacity="0.25"
                mask="url(#path-1-inside-1_3640_34481)"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34481"
                x="0"
                y="-14"
                width="296"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0 0.875 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34481" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34481" result="shape" />
              </filter>
              <linearGradient
                id="paint0_linear_3640_34481"
                x1="54.1925"
                y1="40"
                x2="246"
                y2="40"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#A8A8A8" />
                <stop offset="1" stop-color="#A8A8A8" stop-opacity="0.25" />
              </linearGradient>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '434px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M16.2253 8.78336C15.8304 7.90482 15.1901 7.15905 14.3815 6.63572C13.5728 6.11238 12.6302 5.83376 11.667 5.83336C11.2762 5.83652 10.8873 5.88688 10.5087 5.98336C10.0343 5.31381 9.37286 4.79922 8.60722 4.50413C7.84158 4.20903 7.00585 4.14656 6.20485 4.32456C5.40385 4.50256 4.67324 4.91311 4.10464 5.5047C3.53604 6.09629 3.15478 6.8426 3.00866 7.65003C2.46344 7.84631 2.00334 8.2259 1.70703 8.72389C1.41072 9.22188 1.29661 9.80733 1.3842 10.3801C1.4718 10.953 1.75566 11.4776 2.18725 11.8642C2.61885 12.2509 3.17136 12.4757 3.75032 12.5H4.58366C4.57497 12.6388 4.57497 12.7779 4.58366 12.9167C4.58366 13.6902 4.89095 14.4321 5.43793 14.9791C5.98491 15.5261 6.72678 15.8334 7.50032 15.8334H15.142C16.0039 15.8332 16.8373 15.5245 17.4913 14.9632C18.1454 14.4019 18.5769 13.625 18.7078 12.7731C18.8387 11.9212 18.6604 11.0505 18.205 10.3187C17.7497 9.58693 17.0474 9.04228 16.2253 8.78336ZM3.75032 10.8334C3.52931 10.8334 3.31735 10.7456 3.16107 10.5893C3.00479 10.433 2.91699 10.221 2.91699 10C2.91699 9.77901 3.00479 9.56705 3.16107 9.41077C3.31735 9.25449 3.52931 9.16669 3.75032 9.16669C3.97134 9.16669 4.1833 9.0789 4.33958 8.92262C4.49586 8.76634 4.58366 8.55437 4.58366 8.33336C4.58366 7.67032 4.84705 7.03444 5.31589 6.56559C5.78473 6.09675 6.42062 5.83336 7.08366 5.83336C7.43314 5.83524 7.77835 5.91037 8.097 6.05391C8.41565 6.19744 8.70067 6.4062 8.93366 6.66669C8.34226 7.05149 7.839 7.55709 7.45695 8.15027C7.0749 8.74345 6.82273 9.41077 6.71699 10.1084C6.24597 10.241 5.81603 10.4904 5.46699 10.8334H3.75032ZM15.142 14.1667H7.50032C7.1688 14.1667 6.85086 14.035 6.61644 13.8006C6.38202 13.5662 6.25032 13.2482 6.25032 12.9167C6.25032 12.5852 6.38202 12.2672 6.61644 12.0328C6.85086 11.7984 7.1688 11.6667 7.50032 11.6667C7.72134 11.6667 7.9333 11.5789 8.08958 11.4226C8.24586 11.2663 8.33366 11.0544 8.33366 10.8334C8.33723 10.0464 8.61909 9.28616 9.12936 8.68709C9.63962 8.08801 10.3454 7.68878 11.1217 7.56006C11.898 7.43134 12.6949 7.58142 13.3712 7.98375C14.0475 8.38608 14.5596 9.01471 14.817 9.75836C14.8646 9.90156 14.9503 10.0291 15.0647 10.1275C15.1792 10.2258 15.3182 10.2912 15.467 10.3167C15.94 10.4051 16.3633 10.666 16.6549 11.0489C16.9464 11.4317 17.0854 11.9091 17.0449 12.3886C17.0045 12.8681 16.7874 13.3155 16.4358 13.644C16.0842 13.9725 15.6231 14.1588 15.142 14.1667Z"
                fill="#B9B9B9"
              />
            </svg>
            <Typography size="bodyText" style={{ color: '#B9B9B9', marginLeft: '10px' }}>
              소신지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#B9B9B9',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '404px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 75%이내예요.
          </Typography>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="264"
            height="149"
            viewBox="0 0 264 149"
            fill="none"
            style={{ marginLeft: '-110px' }}
          >
            <g filter="url(#filter0_d_3640_34551)">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M66 30C63.2386 30 61 32.2386 61 35L61 39.0718L50.5 45.134C49.8333 45.5189 49.8333 46.4811 50.5 46.866L61 52.9282L61 74C61 76.7614 63.2386 79 66 79H243C245.761 79 248 76.7614 248 74V35C248 32.2386 245.761 30 243 30H66Z"
                fill="#E84549"
              />
            </g>
            <defs>
              <filter
                id="filter0_d_3640_34551"
                x="0"
                y="0"
                width="298"
                height="149"
                filterUnits="userSpaceOnUse"
                color-interpolation-filters="sRGB"
              >
                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                <feColorMatrix
                  in="SourceAlpha"
                  type="matrix"
                  values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  result="hardAlpha"
                />
                <feOffset dy="20" />
                <feGaussianBlur stdDeviation="25" />
                <feComposite in2="hardAlpha" operator="out" />
                <feColorMatrix type="matrix" values="0 0 0 0 0.909804 0 0 0 0 0.270588 0 0 0 0 0.286275 0 0 0 0.4 0" />
                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_3640_34551" />
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3640_34551" result="shape" />
              </filter>
            </defs>
          </svg>
          <div
            style={{
              position: 'absolute',
              display: 'flex',
              alignItems: 'center',
              marginTop: '45px',
              marginLeft: '624px',
            }}
          >
            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path
                d="M6.66701 10.8333C6.44599 10.8333 6.23403 10.9211 6.07775 11.0774C5.92147 11.2337 5.83368 11.4456 5.83368 11.6667V15.8333C5.83368 16.0543 5.92147 16.2663 6.07775 16.4226C6.23403 16.5789 6.44599 16.6667 6.66701 16.6667C6.88802 16.6667 7.09998 16.5789 7.25626 16.4226C7.41254 16.2663 7.50034 16.0543 7.50034 15.8333V11.6667C7.50034 11.4456 7.41254 11.2337 7.25626 11.0774C7.09998 10.9211 6.88802 10.8333 6.66701 10.8333ZM10.0003 9.16666C9.77933 9.16666 9.56737 9.25446 9.41109 9.41074C9.25481 9.56702 9.16701 9.77898 9.16701 9.99999V17.5C9.16701 17.721 9.25481 17.933 9.41109 18.0893C9.56737 18.2455 9.77933 18.3333 10.0003 18.3333C10.2214 18.3333 10.4333 18.2455 10.5896 18.0893C10.7459 17.933 10.8337 17.721 10.8337 17.5V9.99999C10.8337 9.77898 10.7459 9.56702 10.5896 9.41074C10.4333 9.25446 10.2214 9.16666 10.0003 9.16666ZM15.3503 5.18333C14.8412 4.01333 13.9624 3.04256 12.8487 2.41977C11.7351 1.79697 10.4479 1.55652 9.18448 1.73525C7.92107 1.91398 6.75111 2.50204 5.85389 3.40931C4.95666 4.31657 4.38167 5.49301 4.21701 6.75833C3.48985 6.93413 2.84298 7.34943 2.38045 7.93742C1.91792 8.52541 1.66663 9.25189 1.66701 9.99999C1.66552 10.472 1.7643 10.939 1.9568 11.3699C2.14931 11.8009 2.43115 12.1861 2.78368 12.5C2.86481 12.5779 2.96087 12.6386 3.06609 12.6784C3.17131 12.7182 3.28349 12.7363 3.39589 12.7316C3.50828 12.7269 3.61856 12.6995 3.72007 12.651C3.82158 12.6025 3.91222 12.534 3.98654 12.4495C4.06085 12.3651 4.1173 12.2664 4.15248 12.1596C4.18766 12.0527 4.20084 11.9399 4.19123 11.8278C4.18162 11.7157 4.14941 11.6067 4.09656 11.5074C4.0437 11.4081 3.97128 11.3206 3.88368 11.25C3.70893 11.0923 3.56957 10.8994 3.47477 10.6839C3.37997 10.4685 3.33188 10.2354 3.33368 9.99999C3.33368 9.55797 3.50927 9.13404 3.82183 8.82148C4.13439 8.50892 4.55831 8.33333 5.00034 8.33333C5.22136 8.33333 5.43332 8.24553 5.5896 8.08925C5.74588 7.93297 5.83368 7.72101 5.83368 7.49999C5.8358 6.51439 6.18725 5.56146 6.82557 4.81048C7.46389 4.05951 8.34775 3.55912 9.32013 3.39822C10.2925 3.23732 11.2905 3.42633 12.1366 3.93167C12.9828 4.437 13.6225 5.22594 13.942 6.15833C13.9896 6.30153 14.0753 6.4291 14.1897 6.52744C14.3042 6.62577 14.4433 6.69117 14.592 6.71666C15.1705 6.81644 15.6954 7.1166 16.0748 7.56455C16.4542 8.01249 16.6638 8.57966 16.667 9.16666C16.6798 9.78023 16.4594 10.3758 16.0503 10.8333C15.9173 10.999 15.8526 11.2092 15.8694 11.421C15.8862 11.6329 15.9833 11.8303 16.1408 11.9729C16.2983 12.1155 16.5043 12.1925 16.7168 12.1883C16.9292 12.184 17.132 12.0988 17.2837 11.95C17.7427 11.4255 18.0628 10.7942 18.2146 10.1139C18.3665 9.43362 18.3453 8.72613 18.1529 8.05619C17.9605 7.38625 17.6032 6.77527 17.1136 6.27919C16.624 5.78311 16.0177 5.41778 15.3503 5.21666V5.18333ZM13.3337 10.8333C13.1127 10.8333 12.9007 10.9211 12.7444 11.0774C12.5881 11.2337 12.5003 11.4456 12.5003 11.6667V15.8333C12.5003 16.0543 12.5881 16.2663 12.7444 16.4226C12.9007 16.5789 13.1127 16.6667 13.3337 16.6667C13.5547 16.6667 13.7667 16.5789 13.9229 16.4226C14.0792 16.2663 14.167 16.0543 14.167 15.8333V11.6667C14.167 11.4456 14.0792 11.2337 13.9229 11.0774C13.7667 10.9211 13.5547 10.8333 13.3337 10.8333Z"
                fill="white"
              />
            </svg>
            <Typography size="bodyText" style={{ color: 'var(--White, #FFF)', marginLeft: '10px' }}>
              위험지원
            </Typography>
          </div>
          <Typography
            size="smallText"
            style={{
              position: 'absolute',
              color: '#E84549',
              lineHeight: '128.571%',
              marginTop: '84px',
              marginLeft: '594px',
            }}
          >
            도전자님의 학점은 모의지원자 중
            <br />
            상위 100%이내예요.
          </Typography>
          <div style={{ position: 'absolute', display: 'flex', flexDirection: 'column' }}>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="2"
              height="102"
              viewBox="0 0 2 102"
              fill="none"
              style={{ marginLeft: '828px', marginTop: '15px' }}
            >
              <path d="M1 101L0.999996 1" stroke="#DFDFDF" stroke-linecap="round" />
            </svg>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-103px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {HopeMajor}
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                  marginLeft: '5px',
                }}
              >
                이중 지원자들 중
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '763px', marginTop: '-3px' }}>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                {MyName}님의&nbsp;
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  // marginLeft: '100px',
                  fontWeight: '700',
                  lineHeight: '133.333%',
                }}
              >
                학점
              </Typography>
              <Typography
                size="mediumText"
                style={{
                  color: 'var(--Main-Black, #141414)',
                  fontWeight: '400',
                }}
              >
                은 상위
              </Typography>
            </div>
            <div style={{ display: 'flex', alignItems: 'baseline', marginLeft: '770px', marginTop: '2px' }}>
              <Typography
                size="heading1"
                style={{
                  color: '#D85888',
                  marginLeft: '100px',
                  lineHeight: '104.167%',
                }}
              >
                {myPercentile.toFixed(2)}
              </Typography>
              <Typography
                size="heading1"
                style={{
                  color: 'rgba(67, 67, 67, 0.80)',
                  fontWeight: '400',
                  lineHeight: '104.167%',
                  marginLeft: '10px',
                }}
              >
                %
              </Typography>
            </div>
          </div>
        </div>
      );
  }
};

export default MyStageChart;
